doc/ex-de-20221220/detax/out.org
* the sum of all positive elements, ignoring negative elements
