doc/ex-de-20221220/detax/out.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-10 Tue 16:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wong Meng Weng" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org46e5b68">1. the sum of all positive elements, ignoring negative elements</a></li>
<li><a href="#orga85877d">2. xplainF</a>
<ul>
<li><a href="#orgd79e5da">2.1. toplevel: val = -3.0</a></li>
<li><a href="#orga60b640">2.2. toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</a></li>
<li><a href="#orga7af743">2.3. toplevel: log = []</a></li>
<li><a href="#orga059e46">2.4. toplevel: xpl = -3.0</a>
<ul>
<li><a href="#org5fc1002">2.4.1. -3.0 = sum of 2 elements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcc1fd9f">3. the product of the doubles of all positive elements, ignoring negative and zero elements</a></li>
<li><a href="#org56d0cdf">4. xplainF</a>
<ul>
<li><a href="#org248de2c">4.1. toplevel: val = 48.0</a></li>
<li><a href="#org68e1f63">4.2. toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</a></li>
<li><a href="#orgac55c1c">4.3. toplevel: log = []</a></li>
<li><a href="#org5f1469d">4.4. toplevel: xpl = 48.0</a>
<ul>
<li><a href="#orgabcc033">4.4.1. 48.0 = product of 3 elements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org72f50f5">5. the product of the doubles of all positive elements and the unchanged original values of all negative elements</a></li>
<li><a href="#org94c7544">6. xplainF</a>
<ul>
<li><a href="#org3fbe915">6.1. toplevel: val = 96.0</a></li>
<li><a href="#org2c98613">6.2. toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</a></li>
<li><a href="#orge6ceafe">6.3. toplevel: log = []</a></li>
<li><a href="#org7a3e761">6.4. toplevel: xpl = 96.0</a>
<ul>
<li><a href="#orgdc3fc8b">6.4.1. 96.0 = product of 5 elements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcb9e1e4">7. calculate net income</a></li>
<li><a href="#org8200b96">8. addCol net income</a>
<ul>
<li><a href="#orga7cbed7">8.1. adding 1 new column ("net income") with 8 rows</a>
<ul>
<li><a href="#org74ef52c">8.1.1. Agriculture = 300000.0</a></li>
<li><a href="#org3f6a1dd">8.1.2. Capital = 0.0</a></li>
<li><a href="#orge5c2210">8.1.3. Employment = 0.0</a></li>
<li><a href="#orgffd7c7a">8.1.4. Exempt Capital = 200.0</a></li>
<li><a href="#org6ba188b">8.1.5. Independent = -6000.0</a></li>
<li><a href="#org56e231b">8.1.6. Other = -100000.0</a></li>
<li><a href="#orgf1076d5">8.1.7. Rents = 70000.0</a></li>
<li><a href="#org12519cb">8.1.8. Trade = 0.0</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org704d61b">9. what is the positive sum of the incomes?</a></li>
<li><a href="#org3f9c2d4">10. xplainF</a>
<ul>
<li><a href="#org9c8245e">10.1. toplevel: val = 370200.0</a></li>
<li><a href="#org8b1ac11">10.2. toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</a></li>
<li><a href="#org947ce44">10.3. toplevel: log = []</a></li>
<li><a href="#org938da40">10.4. toplevel: xpl = 370200.0</a>
<ul>
<li><a href="#org4829748">10.4.1. 370200.0 = sum of 3 elements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga385423">11. what is the negative sum of the incomes?</a></li>
<li><a href="#org180afe5">12. xplainF</a>
<ul>
<li><a href="#org120236f">12.1. toplevel: val = -106000.0</a></li>
<li><a href="#org7dcbce6">12.2. toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</a></li>
<li><a href="#orgb87d924">12.3. toplevel: log = []</a></li>
<li><a href="#org0e24b9d">12.4. toplevel: xpl = -106000.0</a>
<ul>
<li><a href="#org2e6cdc7">12.4.1. -106000.0 = sum of 2 elements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7b0eb5b">13. if the positive sum is greater than 100000, the maximum reduction is half of the negative sum; otherwise it is the entire negative sum</a></li>
<li><a href="#orgfaf29b6">14. xplainF</a>
<ul>
<li><a href="#orgc6a3818">14.1. toplevel: val = -53000.0</a></li>
<li><a href="#org63321cb">14.2. toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</a></li>
<li><a href="#orga9402cf">14.3. toplevel: log = []</a></li>
<li><a href="#orgb20e0f5">14.4. toplevel: xpl = -53000.0</a>
<ul>
<li><a href="#org8cffab1">14.4.1. if PredComp CGT (Val 370200.0) (Val 100000.0) then MathBin Divide (Val (-106000.0)) (Val 2.0) else Val (-106000.0)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga274f27">15. the maximum amount by which we can reduce the positive sum is -53000.0</a></li>
<li><a href="#org5650791">16. xplainF</a>
<ul>
<li><a href="#org6fc01b7">16.1. toplevel: val = 0.0</a></li>
<li><a href="#orgffbbe8b">16.2. toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</a></li>
<li><a href="#orgdbdc288">16.3. toplevel: log = []</a></li>
<li><a href="#orgfff1672">16.4. toplevel: xpl = 0.0</a>
<ul>
<li><a href="#orgb61f054">16.4.1. 0.0 = max of 2 elements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6094042">17. the amount by which we can shrink the negative sum is 0.0</a></li>
<li><a href="#org39d9a68">18. now we prorata reduce both the positive and the negative incomes, by type</a></li>
<li><a href="#org7a63d4a">19. xplainF</a>
<ul>
<li><a href="#orgc0ab008">19.1. toplevel: val = [342949.75,0.0,0.0,228.63316,-6000.0,-100000.0,80021.61,0.0]</a></li>
<li><a href="#org214b70b">19.2. toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</a></li>
<li><a href="#orgd6d0292">19.3. toplevel: log = []</a></li>
<li><a href="#org7b3a921">19.4. toplevel: xpl = [342949.75,0.0,0.0,228.63316,-6000.0,-100000.0,80021.61,0.0]</a>
<ul>
<li><a href="#org1a5f948">19.4.1. deep evaluation to floats</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgde527b1">20. we have a new column "reduction"</a></li>
<li><a href="#org30ae5ba">21. Scenarios</a></li>
<li><a href="#org4fe353a">22. running scenario: 1a</a>
<ul>
<li><a href="#orgb0c50bb">22.1. executing section 2.3</a>
<ul>
<li><a href="#org86115f7">22.1.1. step 1</a></li>
<li><a href="#orgf2689a1">22.1.2. step 2</a></li>
<li><a href="#org649ce11">22.1.3. step 3</a></li>
<li><a href="#orgde53af7">22.1.4. step 4</a></li>
<li><a href="#org4483b35">22.1.5. step 5</a></li>
<li><a href="#org214006a">22.1.6. step 6</a></li>
</ul>
</li>
<li><a href="#org7454634">22.2. explaining section<sub>2</sub><sub>3</sub>: 1a</a></li>
<li><a href="#org7c1769c">22.3. executing section<sub>34</sub><sub>1</sub>: 1a</a></li>
<li><a href="#orgafc5361">22.4. executing section 34.1</a>
<ul>
<li><a href="#org9ee7a9f">22.4.1. step 1</a></li>
<li><a href="#orgb8be8d4">22.4.2. step 2</a></li>
<li><a href="#orgf174a09">22.4.3. step 3</a></li>
<li><a href="#orgc4f4ec6">22.4.4. step 4</a></li>
<li><a href="#org4fbd0ae">22.4.5. step 5</a></li>
<li><a href="#orgfdfc472">22.4.6. step 6</a></li>
<li><a href="#orgf195d85">22.4.7. step 7</a></li>
<li><a href="#org925561e">22.4.8. step 8</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgce5059f">23. running scenario: 1b</a>
<ul>
<li><a href="#org577a461">23.1. executing section 2.3</a>
<ul>
<li><a href="#orgc3b47be">23.1.1. step 1</a></li>
<li><a href="#orgca3a947">23.1.2. step 2</a></li>
<li><a href="#org8efabe0">23.1.3. step 3</a></li>
<li><a href="#orgc9609f3">23.1.4. step 4</a></li>
<li><a href="#org3c0988d">23.1.5. step 5</a></li>
<li><a href="#orgce49c4a">23.1.6. step 6</a></li>
</ul>
</li>
<li><a href="#org70067c1">23.2. explaining section<sub>2</sub><sub>3</sub>: 1b</a></li>
<li><a href="#org74c1a97">23.3. executing section<sub>34</sub><sub>1</sub>: 1b</a></li>
<li><a href="#orgf7d7576">23.4. executing section 34.1</a>
<ul>
<li><a href="#org9dcf420">23.4.1. step 1</a></li>
<li><a href="#orge4e0f36">23.4.2. step 2</a></li>
<li><a href="#org9f1db07">23.4.3. step 3</a></li>
<li><a href="#orga1fdb82">23.4.4. step 4</a></li>
<li><a href="#org418af04">23.4.5. step 5</a></li>
<li><a href="#org25032fb">23.4.6. step 6</a></li>
<li><a href="#orge43d0c7">23.4.7. step 7</a></li>
<li><a href="#orgcd8c519">23.4.8. step 8</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org92a00b6">24. running scenario: 2</a>
<ul>
<li><a href="#orgc6e736a">24.1. executing section 2.3</a>
<ul>
<li><a href="#orgcd5fe7e">24.1.1. step 1</a></li>
<li><a href="#org70e789e">24.1.2. step 2</a></li>
<li><a href="#orgac47c26">24.1.3. step 3</a></li>
<li><a href="#org7b6db33">24.1.4. step 4</a></li>
<li><a href="#org695eb2c">24.1.5. step 5</a></li>
<li><a href="#org68f245a">24.1.6. step 6</a></li>
</ul>
</li>
<li><a href="#org71ac085">24.2. explaining section<sub>2</sub><sub>3</sub>: 2</a></li>
<li><a href="#orgd511679">24.3. executing section<sub>34</sub><sub>1</sub>: 2</a></li>
<li><a href="#orgb5f90b1">24.4. executing section 34.1</a>
<ul>
<li><a href="#org092d3dd">24.4.1. step 1</a></li>
<li><a href="#org090b429">24.4.2. step 2</a></li>
<li><a href="#orge8dade8">24.4.3. step 3</a></li>
<li><a href="#orgab8bcc3">24.4.4. step 4</a></li>
<li><a href="#org0ef157a">24.4.5. step 5</a></li>
<li><a href="#org1cedf58">24.4.6. step 6</a></li>
<li><a href="#org11309c0">24.4.7. step 7</a></li>
<li><a href="#orgd7d3c9e">24.4.8. step 8</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5b3c587">25. running scenario: test case 1</a>
<ul>
<li><a href="#orga957240">25.1. executing section 2.3</a>
<ul>
<li><a href="#org1cc1a5b">25.1.1. step 1</a></li>
<li><a href="#org78bf2ab">25.1.2. step 2</a></li>
<li><a href="#org438ce7c">25.1.3. step 3</a></li>
<li><a href="#org5a1128e">25.1.4. step 4</a></li>
<li><a href="#org3427169">25.1.5. step 5</a></li>
<li><a href="#orgcb7dfbc">25.1.6. step 6</a></li>
</ul>
</li>
<li><a href="#org279b878">25.2. explaining section<sub>2</sub><sub>3</sub>: test case 1</a></li>
<li><a href="#org56a725c">25.3. executing section<sub>34</sub><sub>1</sub>: test case 1</a></li>
<li><a href="#org6ac8edc">25.4. executing section 34.1</a>
<ul>
<li><a href="#org413dd84">25.4.1. step 1</a></li>
<li><a href="#orgb685652">25.4.2. step 2</a></li>
<li><a href="#org9dc80a9">25.4.3. step 3</a></li>
<li><a href="#orgd3474eb">25.4.4. step 4</a></li>
<li><a href="#org36b60c5">25.4.5. step 5</a></li>
<li><a href="#org6cc15dd">25.4.6. step 6</a></li>
<li><a href="#org5276486">25.4.7. step 7</a></li>
<li><a href="#org95d98b6">25.4.8. step 8</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0f0a606">26. running scenario: test case 2</a>
<ul>
<li><a href="#org363d37b">26.1. executing section 2.3</a>
<ul>
<li><a href="#org7d785f4">26.1.1. step 1</a></li>
<li><a href="#org5189a3e">26.1.2. step 2</a></li>
<li><a href="#org7aa1508">26.1.3. step 3</a></li>
<li><a href="#org21c1601">26.1.4. step 4</a></li>
<li><a href="#org0564e58">26.1.5. step 5</a></li>
<li><a href="#orgf50d430">26.1.6. step 6</a></li>
</ul>
</li>
<li><a href="#org8dd7712">26.2. explaining section<sub>2</sub><sub>3</sub>: test case 2</a></li>
<li><a href="#orgb7972e8">26.3. executing section<sub>34</sub><sub>1</sub>: test case 2</a></li>
<li><a href="#org2b548cf">26.4. executing section 34.1</a>
<ul>
<li><a href="#org3f2a459">26.4.1. step 1</a></li>
<li><a href="#org009ad68">26.4.2. step 2</a></li>
<li><a href="#org9d5029d">26.4.3. step 3</a></li>
<li><a href="#orge34d815">26.4.4. step 4</a></li>
<li><a href="#org0b1c684">26.4.5. step 5</a></li>
<li><a href="#org71bffa4">26.4.6. step 6</a></li>
<li><a href="#org89e796f">26.4.7. step 7</a></li>
<li><a href="#org31d28c3">26.4.8. step 8</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgad54e63">27. running scenario: test case 3</a>
<ul>
<li><a href="#orgdf03ca0">27.1. executing section 2.3</a>
<ul>
<li><a href="#org24a33b9">27.1.1. step 1</a></li>
<li><a href="#org1f76230">27.1.2. step 2</a></li>
<li><a href="#org5ca5eb6">27.1.3. step 3</a></li>
<li><a href="#orgd03661b">27.1.4. step 4</a></li>
<li><a href="#org7acc2d7">27.1.5. step 5</a></li>
<li><a href="#orgb8521c1">27.1.6. step 6</a></li>
</ul>
</li>
<li><a href="#org77f10b7">27.2. explaining section<sub>2</sub><sub>3</sub>: test case 3</a></li>
<li><a href="#org5c274bf">27.3. executing section<sub>34</sub><sub>1</sub>: test case 3</a></li>
<li><a href="#orge201d45">27.4. executing section 34.1</a>
<ul>
<li><a href="#org16442cc">27.4.1. step 1</a></li>
<li><a href="#orgdacbd21">27.4.2. step 2</a></li>
<li><a href="#org0bd855c">27.4.3. step 3</a></li>
<li><a href="#orgbfdc053">27.4.4. step 4</a></li>
<li><a href="#org1d3ef7e">27.4.5. step 5</a></li>
<li><a href="#orga5b2c28">27.4.6. step 6</a></li>
<li><a href="#org3c875ab">27.4.7. step 7</a></li>
<li><a href="#org56be61b">27.4.8. step 8</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc7f2d2c">28. running scenario: test case 3 - fired</a>
<ul>
<li><a href="#org0a546d7">28.1. executing section 2.3</a>
<ul>
<li><a href="#org8e350b3">28.1.1. step 1</a></li>
<li><a href="#orga5cffe9">28.1.2. step 2</a></li>
<li><a href="#orgfb407e5">28.1.3. step 3</a></li>
<li><a href="#org594139d">28.1.4. step 4</a></li>
<li><a href="#org93b163e">28.1.5. step 5</a></li>
<li><a href="#org1aa3fcc">28.1.6. step 6</a></li>
</ul>
</li>
<li><a href="#org92f0838">28.2. explaining section<sub>2</sub><sub>3</sub>: test case 3 - fired</a></li>
<li><a href="#org90dff37">28.3. executing section<sub>34</sub><sub>1</sub>: test case 3 - fired</a></li>
<li><a href="#orga4d40ee">28.4. executing section 34.1</a>
<ul>
<li><a href="#org12607b2">28.4.1. step 1</a></li>
<li><a href="#org4ec17e0">28.4.2. step 2</a></li>
<li><a href="#org7234585">28.4.3. step 3</a></li>
<li><a href="#orgd7a873e">28.4.4. step 4</a></li>
<li><a href="#orgfffaf76">28.4.5. step 5</a></li>
<li><a href="#org5b0ee21">28.4.6. step 6</a></li>
<li><a href="#org0c18dd7">28.4.7. step 7</a></li>
<li><a href="#org3112230">28.4.8. step 8</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org73bca46">29. running scenario: test case 3 - unfired</a>
<ul>
<li><a href="#org4bd4d70">29.1. executing section 2.3</a>
<ul>
<li><a href="#org724b58d">29.1.1. step 1</a></li>
<li><a href="#org525b557">29.1.2. step 2</a></li>
<li><a href="#org839c3f8">29.1.3. step 3</a></li>
<li><a href="#org2b1645b">29.1.4. step 4</a></li>
<li><a href="#orgc38ef78">29.1.5. step 5</a></li>
<li><a href="#org35069ec">29.1.6. step 6</a></li>
</ul>
</li>
<li><a href="#org788a264">29.2. explaining section<sub>2</sub><sub>3</sub>: test case 3 - unfired</a></li>
<li><a href="#orgab39ef2">29.3. executing section<sub>34</sub><sub>1</sub>: test case 3 - unfired</a></li>
<li><a href="#orgf70e51a">29.4. executing section 34.1</a>
<ul>
<li><a href="#org62adfdd">29.4.1. step 1</a></li>
<li><a href="#orgc248fb6">29.4.2. step 2</a></li>
<li><a href="#orgddb69d1">29.4.3. step 3</a></li>
<li><a href="#org7b80bec">29.4.4. step 4</a></li>
<li><a href="#org79740eb">29.4.5. step 5</a></li>
<li><a href="#orgf142da4">29.4.6. step 6</a></li>
<li><a href="#orgb86c329">29.4.7. step 7</a></li>
<li><a href="#org0933668">29.4.8. step 8</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7bf7f6e">30. which tax method shall we use to deal with extraordinary income in test case 3?</a>
<ul>
<li><a href="#orgdc46901">30.1. executing section 34.1</a>
<ul>
<li><a href="#org79b947d">30.1.1. step 1</a></li>
<li><a href="#orgac01496">30.1.2. step 2</a></li>
<li><a href="#org083d128">30.1.3. step 3</a></li>
<li><a href="#org4bfeaf0">30.1.4. step 4</a></li>
<li><a href="#org876e79a">30.1.5. step 5</a></li>
<li><a href="#org432bb56">30.1.6. step 6</a></li>
<li><a href="#org39221fb">30.1.7. step 7</a></li>
<li><a href="#org28264d0">30.1.8. step 8</a></li>
</ul>
</li>
<li><a href="#org7756bd8">30.2. executing section 34.1</a>
<ul>
<li><a href="#org3e1d5fa">30.2.1. step 1</a></li>
<li><a href="#orgc358298">30.2.2. step 2</a></li>
<li><a href="#org5fde2ae">30.2.3. step 3</a></li>
<li><a href="#orgc85b9f3">30.2.4. step 4</a></li>
<li><a href="#org6f16185">30.2.5. step 5</a></li>
<li><a href="#org1b88227">30.2.6. step 6</a></li>
<li><a href="#orgc3de824">30.2.7. step 7</a></li>
<li><a href="#org6ac288d">30.2.8. step 8</a></li>
</ul>
</li>
<li><a href="#org6f2cf21">30.3. executing section 2.3</a>
<ul>
<li><a href="#org9a5990b">30.3.1. step 1</a></li>
<li><a href="#org3e4df48">30.3.2. step 2</a></li>
<li><a href="#org5679544">30.3.3. step 3</a></li>
<li><a href="#orgaf98a7d">30.3.4. step 4</a></li>
<li><a href="#org3df751e">30.3.5. step 5</a></li>
<li><a href="#org400e4a8">30.3.6. step 6</a></li>
</ul>
</li>
<li><a href="#org3cdb5b3">30.4. executing section 2.3</a>
<ul>
<li><a href="#org1236d68">30.4.1. step 1</a></li>
<li><a href="#org7d4f480">30.4.2. step 2</a></li>
<li><a href="#orgb0d1f92">30.4.3. step 3</a></li>
<li><a href="#org4c038ed">30.4.4. step 4</a></li>
<li><a href="#org6e36051">30.4.5. step 5</a></li>
<li><a href="#org55dffcf">30.4.6. step 6</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2816988">31. we choose EOFifth</a></li>
</ul>
</div>
</div>
<div id="outline-container-org46e5b68" class="outline-2">
<h2 id="org46e5b68"><span class="section-number-2">1</span> the sum of all positive elements, ignoring negative elements</h2>
</div>
