doc/ex-de-20221220/detax/out.org
* xplainF
#+begin_src haskell
ListFold FoldSum (ListFilt (Val 0.0) CGT (MathList [Val (-2.0),Val (-1.0),Val 0.0,Val 1.0,Val 2.0,Val 3.0]))
#+end_src
** toplevel: val = -3.0
** toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}
** toplevel: log = []
** toplevel: xpl = -3.0
*** -3.0 = sum of 2 elements
- -2.0
- -1.0

**** 2 elements were reduced from an original 6
- -2.0
- -1.0
- 0.0
- 1.0
- 2.0
- 3.0

***** included Val (-2.0) due to passing comparison test

#+begin_example
Val (-2.0)
#+end_example
****** True is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* -2.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: -2.0
#+end_example



***** included Val (-1.0) due to passing comparison test

#+begin_example
Val (-1.0)
#+end_example
****** True is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* -1.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: -1.0
#+end_example



***** excluded Val 0.0 due to failing comparison test

#+begin_example
Val 0.0
#+end_example
****** False is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example



***** excluded Val 1.0 due to failing comparison test

#+begin_example
Val 1.0
#+end_example
****** False is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* 1.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 1.0
#+end_example



***** excluded Val 2.0 due to failing comparison test

#+begin_example
Val 2.0
#+end_example
****** False is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* 2.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 2.0
#+end_example



***** excluded Val 3.0 due to failing comparison test

#+begin_example
Val 3.0
#+end_example
****** False is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* 3.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 3.0
#+end_example




**** -2.0: a leaf value

#+begin_example
toplevel / listfold sum: -2.0
#+end_example

**** -1.0: a leaf value

#+begin_example
toplevel / listfold sum: -1.0
#+end_example


* the product of the doubles of all positive elements, ignoring negative and zero elements
* xplainF
#+begin_src haskell
ListFold FoldProduct (ListMap (MathSection Times (Val 2.0)) (ListFilt (Val 0.0) CLT (MathList [Val (-2.0),Val (-1.0),Val 0.0,Val 1.0,Val 2.0,Val 3.0])))
#+end_src
** toplevel: val = 48.0
** toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}
** toplevel: log = []
** toplevel: xpl = 48.0
*** 48.0 = product of 3 elements
- 2.0
- 4.0
- 6.0

**** fmap mathsection TimesVal 2.0 over 3 elements

***** 3 elements were reduced from an original 6
- -2.0
- -1.0
- 0.0
- 1.0
- 2.0
- 3.0

****** excluded Val (-2.0) due to failing comparison test

#+begin_example
Val (-2.0)
#+end_example
******* False is the result of comparing (<)

******** 0.0: a leaf value

#+begin_example
toplevel / listfold product / fmap mathsection / comparison <: 0.0
#+end_example

******** with


******** -2.0: a leaf value

#+begin_example
toplevel / listfold product / fmap mathsection / comparison <: -2.0
#+end_example



****** excluded Val (-1.0) due to failing comparison test

#+begin_example
Val (-1.0)
#+end_example
******* False is the result of comparing (<)

******** 0.0: a leaf value

#+begin_example
toplevel / listfold product / fmap mathsection / comparison <: 0.0
#+end_example

******** with


******** -1.0: a leaf value

#+begin_example
toplevel / listfold product / fmap mathsection / comparison <: -1.0
#+end_example



****** excluded Val 0.0 due to failing comparison test

#+begin_example
Val 0.0
#+end_example
******* False is the result of comparing (<)

******** 0.0: a leaf value

#+begin_example
toplevel / listfold product / fmap mathsection / comparison <: 0.0
#+end_example

******** with


******** 0.0: a leaf value

#+begin_example
toplevel / listfold product / fmap mathsection / comparison <: 0.0
#+end_example



****** included Val 1.0 due to passing comparison test

#+begin_example
Val 1.0
#+end_example
******* True is the result of comparing (<)

******** 0.0: a leaf value

#+begin_example
toplevel / listfold product / fmap mathsection / comparison <: 0.0
#+end_example

******** with


******** 1.0: a leaf value

#+begin_example
toplevel / listfold product / fmap mathsection / comparison <: 1.0
#+end_example



****** included Val 2.0 due to passing comparison test

#+begin_example
Val 2.0
#+end_example
******* True is the result of comparing (<)

******** 0.0: a leaf value

#+begin_example
toplevel / listfold product / fmap mathsection / comparison <: 0.0
#+end_example

******** with


******** 2.0: a leaf value

#+begin_example
toplevel / listfold product / fmap mathsection / comparison <: 2.0
#+end_example



