doc/ex-de-20221220/detax/out.html
<div id="outline-container-orga85877d" class="outline-2">
<h2 id="orga85877d"><span class="section-number-2">2</span> xplainF</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #7CB8BB;">ListFold</span> <span style="color: #7CB8BB;">FoldSum</span> (<span style="color: #7CB8BB;">ListFilt</span> (<span style="color: #7CB8BB;">Val</span> 0.0) <span style="color: #7CB8BB;">CGT</span> (<span style="color: #7CB8BB;">MathList</span> [<span style="color: #7CB8BB;">Val</span> (<span style="color: #DFAF8F;">-</span>2.0),<span style="color: #7CB8BB;">Val</span> (<span style="color: #DFAF8F;">-</span>1.0),<span style="color: #7CB8BB;">Val</span> 0.0,<span style="color: #7CB8BB;">Val</span> 1.0,<span style="color: #7CB8BB;">Val</span> 2.0,<span style="color: #7CB8BB;">Val</span> 3.0]))
</pre>
</div>
</div>
<div id="outline-container-orgd79e5da" class="outline-3">
<h3 id="orgd79e5da"><span class="section-number-3">2.1</span> toplevel: val = -3.0</h3>
</div>
<div id="outline-container-orga60b640" class="outline-3">
<h3 id="orga60b640"><span class="section-number-3">2.2</span> toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</h3>
</div>
<div id="outline-container-orga7af743" class="outline-3">
<h3 id="orga7af743"><span class="section-number-3">2.3</span> toplevel: log = []</h3>
</div>
<div id="outline-container-orga059e46" class="outline-3">
<h3 id="orga059e46"><span class="section-number-3">2.4</span> toplevel: xpl = -3.0</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org5fc1002" class="outline-4">
<h4 id="org5fc1002"><span class="section-number-4">2.4.1</span> -3.0 = sum of 2 elements</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>-2.0</li>
<li>-1.0</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org2b44670"></a>2 elements were reduced from an original 6<br />
<div class="outline-text-5" id="text-2-4-1-1">
<ul class="org-ul">
<li>-2.0</li>
<li>-1.0</li>
<li>0.0</li>
<li>1.0</li>
<li>2.0</li>
<li>3.0</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org7bc39b1"></a>included Val (-2.0) due to passing comparison test<br />
<div class="outline-text-6" id="text-2-4-1-1-1">
<pre class="example" id="org293ef0d">
Val (-2.0)
</pre>
</div>
<ol class="org-ol">
<li><a id="orgc333f9f"></a>True is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="orgb3672f6"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-2-4-1-1-1-1-1">
<pre class="example" id="orgc743766">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="org084f535"></a>with<br /></li>


<li><a id="orgd1e09d2"></a>-2.0: a leaf value<br />
<div class="outline-text-8" id="text-2-4-1-1-1-1-3">
<pre class="example" id="org89266f2">
toplevel / listfold sum / comparison &gt;: -2.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org6c1a0e8"></a>included Val (-1.0) due to passing comparison test<br />
<div class="outline-text-6" id="text-2-4-1-1-2">
<pre class="example" id="org13bc995">
Val (-1.0)
</pre>
</div>
<ol class="org-ol">
<li><a id="org4b0a779"></a>True is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="org58f08b3"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-2-4-1-1-2-1-1">
<pre class="example" id="org193ee23">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="org6810333"></a>with<br /></li>


<li><a id="orgfb17a50"></a>-1.0: a leaf value<br />
<div class="outline-text-8" id="text-2-4-1-1-2-1-3">
<pre class="example" id="orgefd2b82">
toplevel / listfold sum / comparison &gt;: -1.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org830740b"></a>excluded Val 0.0 due to failing comparison test<br />
<div class="outline-text-6" id="text-2-4-1-1-3">
<pre class="example" id="org86e2832">
Val 0.0
</pre>
</div>
<ol class="org-ol">
<li><a id="orgb4dea51"></a>False is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="orgab26fbd"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-2-4-1-1-3-1-1">
<pre class="example" id="orgc236755">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="org1a7cadc"></a>with<br /></li>


<li><a id="orgd71222a"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-2-4-1-1-3-1-3">
<pre class="example" id="orgb4c8e35">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org66cd8ce"></a>excluded Val 1.0 due to failing comparison test<br />
<div class="outline-text-6" id="text-2-4-1-1-4">
<pre class="example" id="org13a3737">
Val 1.0
</pre>
</div>
<ol class="org-ol">
<li><a id="orga6f95a7"></a>False is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="org6bc5cb5"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-2-4-1-1-4-1-1">
<pre class="example" id="org16366fe">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="orga079108"></a>with<br /></li>


<li><a id="org3b343d9"></a>1.0: a leaf value<br />
<div class="outline-text-8" id="text-2-4-1-1-4-1-3">
<pre class="example" id="org93b7bbf">
toplevel / listfold sum / comparison &gt;: 1.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org83bfc30"></a>excluded Val 2.0 due to failing comparison test<br />
<div class="outline-text-6" id="text-2-4-1-1-5">
<pre class="example" id="org30431d2">
Val 2.0
</pre>
</div>
<ol class="org-ol">
<li><a id="org138bb19"></a>False is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="orgab4b706"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-2-4-1-1-5-1-1">
<pre class="example" id="org191db37">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="org3dbc24c"></a>with<br /></li>


<li><a id="orgf0591d6"></a>2.0: a leaf value<br />
<div class="outline-text-8" id="text-2-4-1-1-5-1-3">
<pre class="example" id="orgccc1a1d">
toplevel / listfold sum / comparison &gt;: 2.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org56cf792"></a>excluded Val 3.0 due to failing comparison test<br />
<div class="outline-text-6" id="text-2-4-1-1-6">
<pre class="example" id="org5108e62">
Val 3.0
</pre>
</div>
<ol class="org-ol">
<li><a id="org52cee51"></a>False is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="org0cbecfe"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-2-4-1-1-6-1-1">
<pre class="example" id="org1190acb">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="orgc42065b"></a>with<br /></li>


<li><a id="org2826bf9"></a>3.0: a leaf value<br />
<div class="outline-text-8" id="text-2-4-1-1-6-1-3">
<pre class="example" id="org7dd33af">
toplevel / listfold sum / comparison &gt;: 3.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>




<li><a id="org6fac259"></a>-2.0: a leaf value<br />
<div class="outline-text-5" id="text-2-4-1-2">
<pre class="example" id="org363e0d8">
toplevel / listfold sum: -2.0
</pre>
</div>
</li>

<li><a id="orgf0806cb"></a>-1.0: a leaf value<br />
<div class="outline-text-5" id="text-2-4-1-3">
<pre class="example" id="org45ba6bb">
toplevel / listfold sum: -1.0
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orgcc1fd9f" class="outline-2">
<h2 id="orgcc1fd9f"><span class="section-number-2">3</span> the product of the doubles of all positive elements, ignoring negative and zero elements</h2>
</div>
<div id="outline-container-org56d0cdf" class="outline-2">
<h2 id="org56d0cdf"><span class="section-number-2">4</span> xplainF</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #7CB8BB;">ListFold</span> <span style="color: #7CB8BB;">FoldProduct</span> (<span style="color: #7CB8BB;">ListMap</span> (<span style="color: #7CB8BB;">MathSection</span> <span style="color: #7CB8BB;">Times</span> (<span style="color: #7CB8BB;">Val</span> 2.0)) (<span style="color: #7CB8BB;">ListFilt</span> (<span style="color: #7CB8BB;">Val</span> 0.0) <span style="color: #7CB8BB;">CLT</span> (<span style="color: #7CB8BB;">MathList</span> [<span style="color: #7CB8BB;">Val</span> (<span style="color: #DFAF8F;">-</span>2.0),<span style="color: #7CB8BB;">Val</span> (<span style="color: #DFAF8F;">-</span>1.0),<span style="color: #7CB8BB;">Val</span> 0.0,<span style="color: #7CB8BB;">Val</span> 1.0,<span style="color: #7CB8BB;">Val</span> 2.0,<span style="color: #7CB8BB;">Val</span> 3.0])))
</pre>
</div>
</div>
<div id="outline-container-org248de2c" class="outline-3">
<h3 id="org248de2c"><span class="section-number-3">4.1</span> toplevel: val = 48.0</h3>
</div>
<div id="outline-container-org68e1f63" class="outline-3">
<h3 id="org68e1f63"><span class="section-number-3">4.2</span> toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</h3>
</div>
<div id="outline-container-orgac55c1c" class="outline-3">
<h3 id="orgac55c1c"><span class="section-number-3">4.3</span> toplevel: log = []</h3>
</div>
<div id="outline-container-org5f1469d" class="outline-3">
<h3 id="org5f1469d"><span class="section-number-3">4.4</span> toplevel: xpl = 48.0</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-orgabcc033" class="outline-4">
<h4 id="orgabcc033"><span class="section-number-4">4.4.1</span> 48.0 = product of 3 elements</h4>
<div class="outline-text-4" id="text-4-4-1">
<ul class="org-ul">
<li>2.0</li>
<li>4.0</li>
<li>6.0</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org58ce1af"></a>fmap mathsection TimesVal 2.0 over 3 elements<br />
<ol class="org-ol">
