doc/ex-de-20221220/detax/out.org
**** row Trade
- starting with ordinary income (0.0)
- plus extraordinary income (0.0) = 0.0
- less ordinary expenses (0.0) = 0.0
- less special expenses (0.0) = 0.0





#+begin_example
                extraordinary income  net income  ordinary expenses  ordinary income  special expenses
Agriculture     270000                300000      0                  30000            0               
Capital         0                     0           0                  0                0               
Employment      0                     0           0                  0                0               
Exempt Capital  100                   200         0                  100              0               
Independent     0                     -6000       6000               0                0               
Other           0                     -100000     100000             0                0               
Rents           0                     70000       2150               72150            0               
Trade           0                     0           0                  0                0               

#+end_example

* what is the positive sum of the incomes?
* xplainF
#+begin_src haskell
ListFold FoldSum (ListFilt (Val 0.0) CLT (MathList [Val 300000.0,Val 0.0,Val 0.0,Val 200.0,Val (-6000.0),Val (-100000.0),Val 70000.0,Val 0.0]))
#+end_src
** toplevel: val = 370200.0
** toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}
** toplevel: log = []
** toplevel: xpl = 370200.0
*** 370200.0 = sum of 3 elements
- 300000.0
- 200.0
- 70000.0

**** 3 elements were reduced from an original 8
- 300000.0
- 0.0
- 0.0
- 200.0
- -6000.0
- -100000.0
- 70000.0
- 0.0

***** included Val 300000.0 due to passing comparison test

#+begin_example
Val 300000.0
#+end_example
****** True is the result of comparing (<)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 0.0
#+end_example

******* with


******* 300000.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 300000.0
#+end_example



***** excluded Val 0.0 due to failing comparison test

#+begin_example
Val 0.0
#+end_example
****** False is the result of comparing (<)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 0.0
#+end_example

******* with


******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 0.0
#+end_example



***** excluded Val 0.0 due to failing comparison test

#+begin_example
Val 0.0
#+end_example
****** False is the result of comparing (<)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 0.0
#+end_example

******* with


******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 0.0
#+end_example



***** included Val 200.0 due to passing comparison test

#+begin_example
Val 200.0
#+end_example
****** True is the result of comparing (<)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 0.0
#+end_example

******* with


******* 200.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 200.0
#+end_example



***** excluded Val (-6000.0) due to failing comparison test

#+begin_example
Val (-6000.0)
#+end_example
****** False is the result of comparing (<)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 0.0
#+end_example

******* with


******* -6000.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: -6000.0
#+end_example



***** excluded Val (-100000.0) due to failing comparison test

#+begin_example
Val (-100000.0)
#+end_example
****** False is the result of comparing (<)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 0.0
#+end_example

******* with


******* -100000.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: -100000.0
#+end_example



***** included Val 70000.0 due to passing comparison test

#+begin_example
Val 70000.0
#+end_example
****** True is the result of comparing (<)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 0.0
#+end_example

******* with


******* 70000.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 70000.0
#+end_example



***** excluded Val 0.0 due to failing comparison test

#+begin_example
Val 0.0
#+end_example
****** False is the result of comparing (<)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 0.0
#+end_example

******* with


******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison <: 0.0
#+end_example




**** 300000.0: a leaf value

#+begin_example
toplevel / listfold sum: 300000.0
#+end_example

**** 200.0: a leaf value

#+begin_example
toplevel / listfold sum: 200.0
#+end_example

