doc/ex-de-20221220/detax/out.html



<div id="outline-container-org12519cb" class="outline-4">
<h4 id="org12519cb"><span class="section-number-4">8.1.8</span> Trade = 0.0</h4>
<div class="outline-text-4" id="text-8-1-8">
</div>
<ol class="org-ol">
<li><a id="org26464bf"></a>row Trade<br />
<div class="outline-text-5" id="text-8-1-8-1">
<ul class="org-ul">
<li>starting with ordinary income (0.0)</li>
<li>plus extraordinary income (0.0) = 0.0</li>
<li>less ordinary expenses (0.0) = 0.0</li>
<li>less special expenses (0.0) = 0.0</li>
</ul>





<pre class="example" id="org55e6d94">
                extraordinary income  net income  ordinary expenses  ordinary income  special expenses
Agriculture     270000                300000      0                  30000            0               
Capital         0                     0           0                  0                0               
Employment      0                     0           0                  0                0               
Exempt Capital  100                   200         0                  100              0               
Independent     0                     -6000       6000               0                0               
Other           0                     -100000     100000             0                0               
Rents           0                     70000       2150               72150            0               
Trade           0                     0           0                  0                0               

</pre>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org704d61b" class="outline-2">
<h2 id="org704d61b"><span class="section-number-2">9</span> what is the positive sum of the incomes?</h2>
</div>
<div id="outline-container-org3f9c2d4" class="outline-2">
<h2 id="org3f9c2d4"><span class="section-number-2">10</span> xplainF</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #7CB8BB;">ListFold</span> <span style="color: #7CB8BB;">FoldSum</span> (<span style="color: #7CB8BB;">ListFilt</span> (<span style="color: #7CB8BB;">Val</span> 0.0) <span style="color: #7CB8BB;">CLT</span> (<span style="color: #7CB8BB;">MathList</span> [<span style="color: #7CB8BB;">Val</span> 300000.0,<span style="color: #7CB8BB;">Val</span> 0.0,<span style="color: #7CB8BB;">Val</span> 0.0,<span style="color: #7CB8BB;">Val</span> 200.0,<span style="color: #7CB8BB;">Val</span> (<span style="color: #DFAF8F;">-</span>6000.0),<span style="color: #7CB8BB;">Val</span> (<span style="color: #DFAF8F;">-</span>100000.0),<span style="color: #7CB8BB;">Val</span> 70000.0,<span style="color: #7CB8BB;">Val</span> 0.0]))
</pre>
</div>
</div>
<div id="outline-container-org9c8245e" class="outline-3">
<h3 id="org9c8245e"><span class="section-number-3">10.1</span> toplevel: val = 370200.0</h3>
</div>
<div id="outline-container-org8b1ac11" class="outline-3">
<h3 id="org8b1ac11"><span class="section-number-3">10.2</span> toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</h3>
</div>
<div id="outline-container-org947ce44" class="outline-3">
<h3 id="org947ce44"><span class="section-number-3">10.3</span> toplevel: log = []</h3>
</div>
<div id="outline-container-org938da40" class="outline-3">
<h3 id="org938da40"><span class="section-number-3">10.4</span> toplevel: xpl = 370200.0</h3>
<div class="outline-text-3" id="text-10-4">
</div>
<div id="outline-container-org4829748" class="outline-4">
<h4 id="org4829748"><span class="section-number-4">10.4.1</span> 370200.0 = sum of 3 elements</h4>
<div class="outline-text-4" id="text-10-4-1">
<ul class="org-ul">
<li>300000.0</li>
<li>200.0</li>
<li>70000.0</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org4520c49"></a>3 elements were reduced from an original 8<br />
<div class="outline-text-5" id="text-10-4-1-1">
<ul class="org-ul">
<li>300000.0</li>
<li>0.0</li>
<li>0.0</li>
<li>200.0</li>
<li>-6000.0</li>
<li>-100000.0</li>
<li>70000.0</li>
<li>0.0</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="orgf60cc86"></a>included Val 300000.0 due to passing comparison test<br />
<div class="outline-text-6" id="text-10-4-1-1-1">
<pre class="example" id="orgebcc902">
Val 300000.0
</pre>
</div>
<ol class="org-ol">
<li><a id="orgdb18b8a"></a>True is the result of comparing (&lt;)<br />
<ol class="org-ol">
<li><a id="orga144c55"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-1-1-1">
<pre class="example" id="orgae72761">
toplevel / listfold sum / comparison &lt;: 0.0
</pre>
</div>
</li>

<li><a id="org47b0ce0"></a>with<br /></li>


<li><a id="org872ef07"></a>300000.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-1-1-3">
<pre class="example" id="org479f312">
toplevel / listfold sum / comparison &lt;: 300000.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="orgc9949fd"></a>excluded Val 0.0 due to failing comparison test<br />
<div class="outline-text-6" id="text-10-4-1-1-2">
<pre class="example" id="org2a05b57">
Val 0.0
</pre>
</div>
<ol class="org-ol">
<li><a id="org6bfbc7e"></a>False is the result of comparing (&lt;)<br />
<ol class="org-ol">
<li><a id="orgeb0ab85"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-2-1-1">
<pre class="example" id="orge5173bf">
toplevel / listfold sum / comparison &lt;: 0.0
</pre>
</div>
</li>

<li><a id="org1176e94"></a>with<br /></li>


<li><a id="org2377ea3"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-2-1-3">
<pre class="example" id="orgcb31555">
toplevel / listfold sum / comparison &lt;: 0.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org0f153d1"></a>excluded Val 0.0 due to failing comparison test<br />
<div class="outline-text-6" id="text-10-4-1-1-3">
<pre class="example" id="org7fa753f">
Val 0.0
</pre>
</div>
<ol class="org-ol">
<li><a id="orgf0aebcb"></a>False is the result of comparing (&lt;)<br />
<ol class="org-ol">
<li><a id="org6caa0db"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-3-1-1">
<pre class="example" id="org0c803ef">
toplevel / listfold sum / comparison &lt;: 0.0
</pre>
</div>
</li>

<li><a id="org1311ed1"></a>with<br /></li>


<li><a id="orgf792cd7"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-3-1-3">
<pre class="example" id="orgc29ee7b">
toplevel / listfold sum / comparison &lt;: 0.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="orgb31f43d"></a>included Val 200.0 due to passing comparison test<br />
<div class="outline-text-6" id="text-10-4-1-1-4">
<pre class="example" id="org67686f1">
Val 200.0
</pre>
</div>
<ol class="org-ol">
<li><a id="orgb122b10"></a>True is the result of comparing (&lt;)<br />
<ol class="org-ol">
<li><a id="orgc35d009"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-4-1-1">
<pre class="example" id="org4f2747a">
toplevel / listfold sum / comparison &lt;: 0.0
</pre>
</div>
</li>

<li><a id="orgc3998ac"></a>with<br /></li>


<li><a id="org34af6d0"></a>200.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-4-1-3">
<pre class="example" id="orgf707eed">
toplevel / listfold sum / comparison &lt;: 200.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org2321703"></a>excluded Val (-6000.0) due to failing comparison test<br />
<div class="outline-text-6" id="text-10-4-1-1-5">
<pre class="example" id="org235dd0a">
Val (-6000.0)
</pre>
</div>
<ol class="org-ol">
<li><a id="org17cbb87"></a>False is the result of comparing (&lt;)<br />
<ol class="org-ol">
<li><a id="orgbb84cc3"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-5-1-1">
<pre class="example" id="org05b3138">
toplevel / listfold sum / comparison &lt;: 0.0
</pre>
</div>
</li>

<li><a id="orge2974ff"></a>with<br /></li>


<li><a id="orga4e0154"></a>-6000.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-5-1-3">
<pre class="example" id="org982e368">
toplevel / listfold sum / comparison &lt;: -6000.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="orga884a19"></a>excluded Val (-100000.0) due to failing comparison test<br />
<div class="outline-text-6" id="text-10-4-1-1-6">
<pre class="example" id="org409baa3">
Val (-100000.0)
</pre>
</div>
<ol class="org-ol">
<li><a id="org7643d12"></a>False is the result of comparing (&lt;)<br />
<ol class="org-ol">
<li><a id="orga650649"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-6-1-1">
<pre class="example" id="org03e5e27">
toplevel / listfold sum / comparison &lt;: 0.0
</pre>
</div>
</li>

<li><a id="org9a13a85"></a>with<br /></li>


<li><a id="org2f635da"></a>-100000.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-6-1-3">
<pre class="example" id="orga122b76">
toplevel / listfold sum / comparison &lt;: -100000.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org2b37aa5"></a>included Val 70000.0 due to passing comparison test<br />
<div class="outline-text-6" id="text-10-4-1-1-7">
<pre class="example" id="org94d890f">
Val 70000.0
</pre>
</div>
<ol class="org-ol">
<li><a id="orgadae639"></a>True is the result of comparing (&lt;)<br />
<ol class="org-ol">
<li><a id="orgb773a78"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-7-1-1">
<pre class="example" id="org89022d5">
toplevel / listfold sum / comparison &lt;: 0.0
</pre>
</div>
</li>

<li><a id="org63f9f42"></a>with<br /></li>


<li><a id="orgdbd14a5"></a>70000.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-7-1-3">
<pre class="example" id="org6b673f2">
toplevel / listfold sum / comparison &lt;: 70000.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="orgdd41374"></a>excluded Val 0.0 due to failing comparison test<br />
<div class="outline-text-6" id="text-10-4-1-1-8">
<pre class="example" id="org7cf0f94">
Val 0.0
</pre>
</div>
<ol class="org-ol">
<li><a id="org1d5ec1e"></a>False is the result of comparing (&lt;)<br />
<ol class="org-ol">
<li><a id="org27cde5c"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-8-1-1">
<pre class="example" id="orgbf33dd0">
toplevel / listfold sum / comparison &lt;: 0.0
</pre>
</div>
</li>

<li><a id="org21373c6"></a>with<br /></li>


<li><a id="org915c9e1"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-10-4-1-1-8-1-3">
<pre class="example" id="orgb334008">
toplevel / listfold sum / comparison &lt;: 0.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>




<li><a id="orgcdd80d8"></a>300000.0: a leaf value<br />
<div class="outline-text-5" id="text-10-4-1-2">
<pre class="example" id="org6ac19f9">
toplevel / listfold sum: 300000.0
</pre>
</div>
</li>

<li><a id="org4654318"></a>200.0: a leaf value<br />
<div class="outline-text-5" id="text-10-4-1-3">
<pre class="example" id="orgd0e6b17">
toplevel / listfold sum: 200.0
</pre>
</div>
</li>
