doc/ex-de-20221220/detax/out.org
**** 70000.0: a leaf value

#+begin_example
toplevel / listfold sum: 70000.0
#+end_example


* what is the negative sum of the incomes?
* xplainF
#+begin_src haskell
ListFold FoldSum (ListFilt (Val 0.0) CGT (MathList [Val 300000.0,Val 0.0,Val 0.0,Val 200.0,Val (-6000.0),Val (-100000.0),Val 70000.0,Val 0.0]))
#+end_src
** toplevel: val = -106000.0
** toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}
** toplevel: log = []
** toplevel: xpl = -106000.0
*** -106000.0 = sum of 2 elements
- -6000.0
- -100000.0

**** 2 elements were reduced from an original 8
- 300000.0
- 0.0
- 0.0
- 200.0
- -6000.0
- -100000.0
- 70000.0
- 0.0

***** excluded Val 300000.0 due to failing comparison test

#+begin_example
Val 300000.0
#+end_example
****** False is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* 300000.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 300000.0
#+end_example



***** excluded Val 0.0 due to failing comparison test

#+begin_example
Val 0.0
#+end_example
****** False is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example



***** excluded Val 0.0 due to failing comparison test

#+begin_example
Val 0.0
#+end_example
****** False is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example



***** excluded Val 200.0 due to failing comparison test

#+begin_example
Val 200.0
#+end_example
****** False is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* 200.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 200.0
#+end_example



***** included Val (-6000.0) due to passing comparison test

#+begin_example
Val (-6000.0)
#+end_example
****** True is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* -6000.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: -6000.0
#+end_example



***** included Val (-100000.0) due to passing comparison test

#+begin_example
Val (-100000.0)
#+end_example
****** True is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* -100000.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: -100000.0
#+end_example



***** excluded Val 70000.0 due to failing comparison test

#+begin_example
Val 70000.0
#+end_example
****** False is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* 70000.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 70000.0
#+end_example



***** excluded Val 0.0 due to failing comparison test

#+begin_example
Val 0.0
#+end_example
****** False is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example

******* with


******* 0.0: a leaf value

#+begin_example
toplevel / listfold sum / comparison >: 0.0
#+end_example




**** -6000.0: a leaf value

#+begin_example
toplevel / listfold sum: -6000.0
#+end_example

**** -100000.0: a leaf value

#+begin_example
toplevel / listfold sum: -100000.0
#+end_example


* if the positive sum is greater than 100000, the maximum reduction is half of the negative sum; otherwise it is the entire negative sum
* xplainF
#+begin_src haskell
MathITE (PredComp CGT (Val 370200.0) (Val 100000.0)) (MathBin Divide (Val (-106000.0)) (Val 2.0)) (Val (-106000.0))
#+end_src
** toplevel: val = -53000.0
** toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}
** toplevel: log = []
** toplevel: xpl = -53000.0
