doc/ex-de-20221220/detax/out.html

<li><a id="orge3ef2dd"></a>70000.0: a leaf value<br />
<div class="outline-text-5" id="text-10-4-1-4">
<pre class="example" id="orgecd6f3b">
toplevel / listfold sum: 70000.0
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orga385423" class="outline-2">
<h2 id="orga385423"><span class="section-number-2">11</span> what is the negative sum of the incomes?</h2>
</div>
<div id="outline-container-org180afe5" class="outline-2">
<h2 id="org180afe5"><span class="section-number-2">12</span> xplainF</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #7CB8BB;">ListFold</span> <span style="color: #7CB8BB;">FoldSum</span> (<span style="color: #7CB8BB;">ListFilt</span> (<span style="color: #7CB8BB;">Val</span> 0.0) <span style="color: #7CB8BB;">CGT</span> (<span style="color: #7CB8BB;">MathList</span> [<span style="color: #7CB8BB;">Val</span> 300000.0,<span style="color: #7CB8BB;">Val</span> 0.0,<span style="color: #7CB8BB;">Val</span> 0.0,<span style="color: #7CB8BB;">Val</span> 200.0,<span style="color: #7CB8BB;">Val</span> (<span style="color: #DFAF8F;">-</span>6000.0),<span style="color: #7CB8BB;">Val</span> (<span style="color: #DFAF8F;">-</span>100000.0),<span style="color: #7CB8BB;">Val</span> 70000.0,<span style="color: #7CB8BB;">Val</span> 0.0]))
</pre>
</div>
</div>
<div id="outline-container-org120236f" class="outline-3">
<h3 id="org120236f"><span class="section-number-3">12.1</span> toplevel: val = -106000.0</h3>
</div>
<div id="outline-container-org7dcbce6" class="outline-3">
<h3 id="org7dcbce6"><span class="section-number-3">12.2</span> toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</h3>
</div>
<div id="outline-container-orgb87d924" class="outline-3">
<h3 id="orgb87d924"><span class="section-number-3">12.3</span> toplevel: log = []</h3>
</div>
<div id="outline-container-org0e24b9d" class="outline-3">
<h3 id="org0e24b9d"><span class="section-number-3">12.4</span> toplevel: xpl = -106000.0</h3>
<div class="outline-text-3" id="text-12-4">
</div>
<div id="outline-container-org2e6cdc7" class="outline-4">
<h4 id="org2e6cdc7"><span class="section-number-4">12.4.1</span> -106000.0 = sum of 2 elements</h4>
<div class="outline-text-4" id="text-12-4-1">
<ul class="org-ul">
<li>-6000.0</li>
<li>-100000.0</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org5bb7639"></a>2 elements were reduced from an original 8<br />
<div class="outline-text-5" id="text-12-4-1-1">
<ul class="org-ul">
<li>300000.0</li>
<li>0.0</li>
<li>0.0</li>
<li>200.0</li>
<li>-6000.0</li>
<li>-100000.0</li>
<li>70000.0</li>
<li>0.0</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="orgadbd831"></a>excluded Val 300000.0 due to failing comparison test<br />
<div class="outline-text-6" id="text-12-4-1-1-1">
<pre class="example" id="org67e2985">
Val 300000.0
</pre>
</div>
<ol class="org-ol">
<li><a id="org212879c"></a>False is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="org4bfebea"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-1-1-1">
<pre class="example" id="orgda64d49">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="org5b934cf"></a>with<br /></li>


<li><a id="org00ab62b"></a>300000.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-1-1-3">
<pre class="example" id="org8fe84aa">
toplevel / listfold sum / comparison &gt;: 300000.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org3cbf186"></a>excluded Val 0.0 due to failing comparison test<br />
<div class="outline-text-6" id="text-12-4-1-1-2">
<pre class="example" id="orgf722a08">
Val 0.0
</pre>
</div>
<ol class="org-ol">
<li><a id="org44b1f22"></a>False is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="orge2cf370"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-2-1-1">
<pre class="example" id="org42c1e4a">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="orgf1878d6"></a>with<br /></li>


<li><a id="orgb16f6b6"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-2-1-3">
<pre class="example" id="orgdb37c21">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org9b92cde"></a>excluded Val 0.0 due to failing comparison test<br />
<div class="outline-text-6" id="text-12-4-1-1-3">
<pre class="example" id="org042ef7a">
Val 0.0
</pre>
</div>
<ol class="org-ol">
<li><a id="orgb98ede2"></a>False is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="orge28a6ec"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-3-1-1">
<pre class="example" id="orgd8d5ea1">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="org5e0e24d"></a>with<br /></li>


<li><a id="org150f261"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-3-1-3">
<pre class="example" id="orgbc0793d">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="orgab8826b"></a>excluded Val 200.0 due to failing comparison test<br />
<div class="outline-text-6" id="text-12-4-1-1-4">
<pre class="example" id="orgb0455ba">
Val 200.0
</pre>
</div>
<ol class="org-ol">
<li><a id="org0962f94"></a>False is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="org028069e"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-4-1-1">
<pre class="example" id="orgc445210">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="org93cc254"></a>with<br /></li>


<li><a id="org241d12c"></a>200.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-4-1-3">
<pre class="example" id="orgcd447a0">
toplevel / listfold sum / comparison &gt;: 200.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org1daabf9"></a>included Val (-6000.0) due to passing comparison test<br />
<div class="outline-text-6" id="text-12-4-1-1-5">
<pre class="example" id="orgdabb7f7">
Val (-6000.0)
</pre>
</div>
<ol class="org-ol">
<li><a id="orgab16181"></a>True is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="org56a21e6"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-5-1-1">
<pre class="example" id="org4d0fa89">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="org2e42eb3"></a>with<br /></li>


<li><a id="org0f43278"></a>-6000.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-5-1-3">
<pre class="example" id="org1990525">
toplevel / listfold sum / comparison &gt;: -6000.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org93cb4dd"></a>included Val (-100000.0) due to passing comparison test<br />
<div class="outline-text-6" id="text-12-4-1-1-6">
<pre class="example" id="orgdb6f5b9">
Val (-100000.0)
</pre>
</div>
<ol class="org-ol">
<li><a id="org6f4bd3f"></a>True is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="org4c9eaf1"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-6-1-1">
<pre class="example" id="org3bd964c">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="orgb331f8c"></a>with<br /></li>


<li><a id="org2edfa55"></a>-100000.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-6-1-3">
<pre class="example" id="org84e91ce">
toplevel / listfold sum / comparison &gt;: -100000.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org3770ffa"></a>excluded Val 70000.0 due to failing comparison test<br />
<div class="outline-text-6" id="text-12-4-1-1-7">
<pre class="example" id="org350e3e3">
Val 70000.0
</pre>
</div>
<ol class="org-ol">
<li><a id="org66de59b"></a>False is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="org2fd1821"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-7-1-1">
<pre class="example" id="orgd8e593a">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="orgb45ae88"></a>with<br /></li>


<li><a id="org557d6dc"></a>70000.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-7-1-3">
<pre class="example" id="org9b7803d">
toplevel / listfold sum / comparison &gt;: 70000.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>



<li><a id="org0cbd8e1"></a>excluded Val 0.0 due to failing comparison test<br />
<div class="outline-text-6" id="text-12-4-1-1-8">
<pre class="example" id="org82b6c89">
Val 0.0
</pre>
</div>
<ol class="org-ol">
<li><a id="org646131b"></a>False is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="orgabfe42e"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-8-1-1">
<pre class="example" id="orgbf3d8fc">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>

<li><a id="orgb0ce50d"></a>with<br /></li>


<li><a id="org971ea3a"></a>0.0: a leaf value<br />
<div class="outline-text-8" id="text-12-4-1-1-8-1-3">
<pre class="example" id="orgf343443">
toplevel / listfold sum / comparison &gt;: 0.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>




<li><a id="orgc2ee33c"></a>-6000.0: a leaf value<br />
<div class="outline-text-5" id="text-12-4-1-2">
<pre class="example" id="org17ed193">
toplevel / listfold sum: -6000.0
</pre>
</div>
</li>

<li><a id="org3ebb97d"></a>-100000.0: a leaf value<br />
<div class="outline-text-5" id="text-12-4-1-3">
<pre class="example" id="org9e405db">
toplevel / listfold sum: -100000.0
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org7b0eb5b" class="outline-2">
<h2 id="org7b0eb5b"><span class="section-number-2">13</span> if the positive sum is greater than 100000, the maximum reduction is half of the negative sum; otherwise it is the entire negative sum</h2>
</div>
<div id="outline-container-orgfaf29b6" class="outline-2">
<h2 id="orgfaf29b6"><span class="section-number-2">14</span> xplainF</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #7CB8BB;">MathITE</span> (<span style="color: #7CB8BB;">PredComp</span> <span style="color: #7CB8BB;">CGT</span> (<span style="color: #7CB8BB;">Val</span> 370200.0) (<span style="color: #7CB8BB;">Val</span> 100000.0)) (<span style="color: #7CB8BB;">MathBin</span> <span style="color: #7CB8BB;">Divide</span> (<span style="color: #7CB8BB;">Val</span> (<span style="color: #DFAF8F;">-</span>106000.0)) (<span style="color: #7CB8BB;">Val</span> 2.0)) (<span style="color: #7CB8BB;">Val</span> (<span style="color: #DFAF8F;">-</span>106000.0))
</pre>
</div>
</div>
<div id="outline-container-orgc6a3818" class="outline-3">
<h3 id="orgc6a3818"><span class="section-number-3">14.1</span> toplevel: val = -53000.0</h3>
</div>
<div id="outline-container-org63321cb" class="outline-3">
<h3 id="org63321cb"><span class="section-number-3">14.2</span> toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</h3>
</div>
<div id="outline-container-orga9402cf" class="outline-3">
<h3 id="orga9402cf"><span class="section-number-3">14.3</span> toplevel: log = []</h3>
</div>
<div id="outline-container-orgb20e0f5" class="outline-3">
<h3 id="orgb20e0f5"><span class="section-number-3">14.4</span> toplevel: xpl = -53000.0</h3>
<div class="outline-text-3" id="text-14-4">
</div>
