doc/ex-de-20221220/detax/out.org
*** if PredComp CGT (Val 370200.0) (Val 100000.0) then MathBin Divide (Val (-106000.0)) (Val 2.0) else Val (-106000.0)

**** True is the result of comparing (>)

***** 370200.0: a leaf value

#+begin_example
toplevel / if-then-else / comparison >: 370200.0
#+end_example

***** with


***** 100000.0: a leaf value

#+begin_example
toplevel / if-then-else / comparison >: 100000.0
#+end_example


**** thus we choose the then branch


**** -53000.0: which we obtain by dividing

#+begin_example
toplevel / if-then-else / division: -106000.0
-106000.0
toplevel / if-then-else / division: 2.0
#+end_example
***** -106000.0: a leaf value

#+begin_example
toplevel / if-then-else / division: -106000.0
#+end_example

***** by


***** 2.0: a leaf value

#+begin_example
-106000.0
toplevel / if-then-else / division: 2.0
#+end_example



* the maximum amount by which we can reduce the positive sum is -53000.0
* xplainF
#+begin_src haskell
MathMax (Val 0.0) (MathBin Plus (Val (-106000.0)) (MathMin (Val 0.0) (Val 370200.0)))
#+end_src
** toplevel: val = 0.0
** toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}
** toplevel: log = []
** toplevel: xpl = 0.0
*** 0.0 = max of 2 elements
- 0.0
- -106000.0

**** base MathList with 2 elements

#+begin_example
Val 0.0
MathBin Plus (Val (-106000.0)) (MathMin (Val 0.0) (Val 370200.0))
#+end_example

**** 0.0: a leaf value

#+begin_example
toplevel / listfold max: 0.0
#+end_example

**** -106000.0: which we obtain by adding

#+begin_example
toplevel / listfold max / addition: -106000.0
#+end_example
***** -106000.0: a leaf value

#+begin_example
toplevel / listfold max / addition: -106000.0
#+end_example

***** to


***** 0.0 = min of 2 elements
- 0.0
- 370200.0

****** base MathList with 2 elements

#+begin_example
Val 0.0
Val 370200.0
#+end_example

****** 0.0: a leaf value

#+begin_example
-106000.0
toplevel / listfold max / addition / listfold min: 0.0
#+end_example

****** 370200.0: a leaf value

#+begin_example
-106000.0
toplevel / listfold max / addition / listfold min: 370200.0
#+end_example




* the amount by which we can shrink the negative sum is 0.0
* now we prorata reduce both the positive and the negative incomes, by type
* xplainF
#+begin_src haskell
ListMapIf (MathSection Times (Val 1.0)) (Val 0.0) CGT (ListMapIf (MathSection Times (Val 1.1431658)) (Val 0.0) CLT (MathList [Val 300000.0,Val 0.0,Val 0.0,Val 200.0,Val (-6000.0),Val (-100000.0),Val 70000.0,Val 0.0]))
#+end_src
** toplevel: val = [342949.75,0.0,0.0,228.63316,-6000.0,-100000.0,80021.61,0.0]
** toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}
** toplevel: log = []
** toplevel: xpl = [342949.75,0.0,0.0,228.63316,-6000.0,-100000.0,80021.61,0.0]
*** deep evaluation to floats

**** fmap mathsection TimesVal 1.0 over 2 relevant elements (who pass Val 0.0 CGT)

***** fmap mathsection TimesVal 1.1431658 over 3 relevant elements (who pass Val 0.0 CLT)

****** base MathList with 8 elements

#+begin_example
Val 300000.0
Val 0.0
Val 0.0
Val 200.0
Val (-6000.0)
Val (-100000.0)
Val 70000.0
Val 0.0
#+end_example

****** selection of relevant elements

******* True is the result of comparing (<)

******** 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 0.0
#+end_example

******** with


******** 300000.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 300000.0
#+end_example


******* False is the result of comparing (<)

******** 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 0.0
#+end_example

******** with


******** 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 0.0
#+end_example


******* False is the result of comparing (<)

******** 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 0.0
#+end_example

******** with


******** 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 0.0
#+end_example


******* True is the result of comparing (<)

******** 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 0.0
#+end_example

******** with


******** 200.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 200.0
#+end_example


******* False is the result of comparing (<)

******** 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 0.0
#+end_example

******** with


******** -6000.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: -6000.0
#+end_example


******* False is the result of comparing (<)

******** 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 0.0
#+end_example

******** with


******** -100000.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: -100000.0
#+end_example


******* True is the result of comparing (<)

******** 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 0.0
#+end_example

******** with


******** 70000.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 70000.0
#+end_example


******* False is the result of comparing (<)

******** 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 0.0
#+end_example

******** with


******** 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / fmap mathsection if / comparison <: 0.0
#+end_example




***** selection of relevant elements

****** False is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / comparison >: 0.0
#+end_example

******* with


******* 342949.75: which we obtain by multiplying

#+begin_example
toplevel / fmap mathsection if / comparison > / multiplication: 1.1431658
1.1431658
toplevel / fmap mathsection if / comparison > / multiplication: 300000.0
#+end_example
******** 1.1431658: a leaf value

#+begin_example
toplevel / fmap mathsection if / comparison > / multiplication: 1.1431658
#+end_example

******** by


******** 300000.0: a leaf value

#+begin_example
1.1431658
toplevel / fmap mathsection if / comparison > / multiplication: 300000.0
#+end_example



****** False is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / comparison >: 0.0
#+end_example

******* with


******* 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / comparison >: 0.0
#+end_example


****** False is the result of comparing (>)

******* 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / comparison >: 0.0
#+end_example

******* with


******* 0.0: a leaf value

#+begin_example
toplevel / fmap mathsection if / comparison >: 0.0
#+end_example


****** False is the result of comparing (>)

