doc/ex-de-20221220/detax/out.html
<div id="outline-container-org8cffab1" class="outline-4">
<h4 id="org8cffab1"><span class="section-number-4">14.4.1</span> if PredComp CGT (Val 370200.0) (Val 100000.0) then MathBin Divide (Val (-106000.0)) (Val 2.0) else Val (-106000.0)</h4>
<div class="outline-text-4" id="text-14-4-1">
</div>
<ol class="org-ol">
<li><a id="orgbb1e3fe"></a>True is the result of comparing (&gt;)<br />
<ol class="org-ol">
<li><a id="orgbe88410"></a>370200.0: a leaf value<br />
<div class="outline-text-6" id="text-14-4-1-1-1">
<pre class="example" id="org0a8a4c7">
toplevel / if-then-else / comparison &gt;: 370200.0
</pre>
</div>
</li>

<li><a id="org2384a18"></a>with<br /></li>


<li><a id="orgb690fe8"></a>100000.0: a leaf value<br />
<div class="outline-text-6" id="text-14-4-1-1-3">
<pre class="example" id="org73c2bbb">
toplevel / if-then-else / comparison &gt;: 100000.0
</pre>
</div>
</li>
</ol>
</li>


<li><a id="org907d15e"></a>thus we choose the then branch<br /></li>


<li><a id="org707400f"></a>-53000.0: which we obtain by dividing<br />
<div class="outline-text-5" id="text-14-4-1-3">
<pre class="example" id="orgbc550dd">
toplevel / if-then-else / division: -106000.0
-106000.0
toplevel / if-then-else / division: 2.0
</pre>
</div>
<ol class="org-ol">
<li><a id="org0bc07e4"></a>-106000.0: a leaf value<br />
<div class="outline-text-6" id="text-14-4-1-3-1">
<pre class="example" id="org5575144">
toplevel / if-then-else / division: -106000.0
</pre>
</div>
</li>

<li><a id="orgeb97279"></a>by<br /></li>


<li><a id="org7be94ee"></a>2.0: a leaf value<br />
<div class="outline-text-6" id="text-14-4-1-3-3">
<pre class="example" id="orgce31aaa">
-106000.0
toplevel / if-then-else / division: 2.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>



<div id="outline-container-orga274f27" class="outline-2">
<h2 id="orga274f27"><span class="section-number-2">15</span> the maximum amount by which we can reduce the positive sum is -53000.0</h2>
</div>
<div id="outline-container-org5650791" class="outline-2">
<h2 id="org5650791"><span class="section-number-2">16</span> xplainF</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #7CB8BB;">MathMax</span> (<span style="color: #7CB8BB;">Val</span> 0.0) (<span style="color: #7CB8BB;">MathBin</span> <span style="color: #7CB8BB;">Plus</span> (<span style="color: #7CB8BB;">Val</span> (<span style="color: #DFAF8F;">-</span>106000.0)) (<span style="color: #7CB8BB;">MathMin</span> (<span style="color: #7CB8BB;">Val</span> 0.0) (<span style="color: #7CB8BB;">Val</span> 370200.0)))
</pre>
</div>
</div>
<div id="outline-container-org6fc01b7" class="outline-3">
<h3 id="org6fc01b7"><span class="section-number-3">16.1</span> toplevel: val = 0.0</h3>
</div>
<div id="outline-container-orgffbbe8b" class="outline-3">
<h3 id="orgffbbe8b"><span class="section-number-3">16.2</span> toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</h3>
</div>
<div id="outline-container-orgdbdc288" class="outline-3">
<h3 id="orgdbdc288"><span class="section-number-3">16.3</span> toplevel: log = []</h3>
</div>
<div id="outline-container-orgfff1672" class="outline-3">
<h3 id="orgfff1672"><span class="section-number-3">16.4</span> toplevel: xpl = 0.0</h3>
<div class="outline-text-3" id="text-16-4">
</div>
<div id="outline-container-orgb61f054" class="outline-4">
<h4 id="orgb61f054"><span class="section-number-4">16.4.1</span> 0.0 = max of 2 elements</h4>
<div class="outline-text-4" id="text-16-4-1">
<ul class="org-ul">
<li>0.0</li>
<li>-106000.0</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="orgdb150a6"></a>base MathList with 2 elements<br />
<div class="outline-text-5" id="text-16-4-1-1">
<pre class="example" id="orgcac4eaa">
Val 0.0
MathBin Plus (Val (-106000.0)) (MathMin (Val 0.0) (Val 370200.0))
</pre>
</div>
</li>

<li><a id="orga8df9b8"></a>0.0: a leaf value<br />
<div class="outline-text-5" id="text-16-4-1-2">
<pre class="example" id="org05d9949">
toplevel / listfold max: 0.0
</pre>
</div>
</li>

<li><a id="org591bf00"></a>-106000.0: which we obtain by adding<br />
<div class="outline-text-5" id="text-16-4-1-3">
<pre class="example" id="org20c4d82">
toplevel / listfold max / addition: -106000.0
</pre>
</div>
<ol class="org-ol">
<li><a id="orgfcbec70"></a>-106000.0: a leaf value<br />
<div class="outline-text-6" id="text-16-4-1-3-1">
<pre class="example" id="org065043f">
toplevel / listfold max / addition: -106000.0
</pre>
</div>
</li>

<li><a id="org521c0fd"></a>to<br /></li>


<li><a id="org2d85046"></a>0.0 = min of 2 elements<br />
<div class="outline-text-6" id="text-16-4-1-3-3">
<ul class="org-ul">
<li>0.0</li>
<li>370200.0</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org8dc3dde"></a>base MathList with 2 elements<br />
<div class="outline-text-7" id="text-16-4-1-3-3-1">
<pre class="example" id="org741030e">
Val 0.0
Val 370200.0
</pre>
</div>
</li>

<li><a id="org36bc8c1"></a>0.0: a leaf value<br />
<div class="outline-text-7" id="text-16-4-1-3-3-2">
<pre class="example" id="orge2d0f5f">
-106000.0
toplevel / listfold max / addition / listfold min: 0.0
</pre>
</div>
</li>

<li><a id="orgf05a392"></a>370200.0: a leaf value<br />
<div class="outline-text-7" id="text-16-4-1-3-3-3">
<pre class="example" id="org5bbd192">
-106000.0
toplevel / listfold max / addition / listfold min: 370200.0
</pre>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>




<div id="outline-container-org6094042" class="outline-2">
<h2 id="org6094042"><span class="section-number-2">17</span> the amount by which we can shrink the negative sum is 0.0</h2>
</div>
<div id="outline-container-org39d9a68" class="outline-2">
<h2 id="org39d9a68"><span class="section-number-2">18</span> now we prorata reduce both the positive and the negative incomes, by type</h2>
</div>
<div id="outline-container-org7a63d4a" class="outline-2">
<h2 id="org7a63d4a"><span class="section-number-2">19</span> xplainF</h2>
<div class="outline-text-2" id="text-19">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #7CB8BB;">ListMapIf</span> (<span style="color: #7CB8BB;">MathSection</span> <span style="color: #7CB8BB;">Times</span> (<span style="color: #7CB8BB;">Val</span> 1.0)) (<span style="color: #7CB8BB;">Val</span> 0.0) <span style="color: #7CB8BB;">CGT</span> (<span style="color: #7CB8BB;">ListMapIf</span> (<span style="color: #7CB8BB;">MathSection</span> <span style="color: #7CB8BB;">Times</span> (<span style="color: #7CB8BB;">Val</span> 1.1431658)) (<span style="color: #7CB8BB;">Val</span> 0.0) <span style="color: #7CB8BB;">CLT</span> (<span style="color: #7CB8BB;">MathList</span> [<span style="color: #7CB8BB;">Val</span> 300000.0,<span style="color: #7CB8BB;">Val</span> 0.0,<span style="color: #7CB8BB;">Val</span> 0.0,<span style="color: #7CB8BB;">Val</span> 200.0,<span style="color: #7CB8BB;">Val</span> (<span style="color: #DFAF8F;">-</span>6000.0),<span style="color: #7CB8BB;">Val</span> (<span style="color: #DFAF8F;">-</span>100000.0),<span style="color: #7CB8BB;">Val</span> 70000.0,<span style="color: #7CB8BB;">Val</span> 0.0]))
</pre>
</div>
</div>
<div id="outline-container-orgc0ab008" class="outline-3">
<h3 id="orgc0ab008"><span class="section-number-3">19.1</span> toplevel: val = [342949.75,0.0,0.0,228.63316,-6000.0,-100000.0,80021.61,0.0]</h3>
</div>
<div id="outline-container-org214b70b" class="outline-3">
<h3 id="org214b70b"><span class="section-number-3">19.2</span> toplevel: symtab = MyState {symtabF = fromList [], symtabP = fromList []}</h3>
</div>
<div id="outline-container-orgd6d0292" class="outline-3">
<h3 id="orgd6d0292"><span class="section-number-3">19.3</span> toplevel: log = []</h3>
</div>
<div id="outline-container-org7b3a921" class="outline-3">
<h3 id="org7b3a921"><span class="section-number-3">19.4</span> toplevel: xpl = [342949.75,0.0,0.0,228.63316,-6000.0,-100000.0,80021.61,0.0]</h3>
<div class="outline-text-3" id="text-19-4">
</div>
<div id="outline-container-org1a5f948" class="outline-4">
<h4 id="org1a5f948"><span class="section-number-4">19.4.1</span> deep evaluation to floats</h4>
<div class="outline-text-4" id="text-19-4-1">
</div>
<ol class="org-ol">
<li><a id="org92b9099"></a>fmap mathsection TimesVal 1.0 over 2 relevant elements (who pass Val 0.0 CGT)<br />
<ol class="org-ol">
<li><a id="orgce53f5d"></a>fmap mathsection TimesVal 1.1431658 over 3 relevant elements (who pass Val 0.0 CLT)<br />
<ol class="org-ol">
<li><a id="org59bd367"></a>base MathList with 8 elements<br />
<div class="outline-text-7" id="text-19-4-1-1-1-1">
<pre class="example" id="org2b18875">
Val 300000.0
Val 0.0
Val 0.0
Val 200.0
Val (-6000.0)
Val (-100000.0)
Val 70000.0
Val 0.0
</pre>
</div>
</li>
