doc/ex-de-20221220/detax/out.org
** executing section 2.3
RUNNING - metaFsc squashIncomes
270000.0
100.0
RETURNING - metaFsc squashIncomes
RUNNING - metaFsc netIncome
fromList [("net income",fromList [("Agriculture",300000.0),("Capital",0.0),("Employment",0.0),("Exempt Capital",200.0),("Independent",-6000.0),("Other",-100000.0),("Rents",70000.0),("Trade",0.0)])]
RETURNING - metaFsc netIncome
RUNNING - offsetLosses_2_3_3
fromList [("net income",fromList [("Agriculture",300000.0),("Capital",0.0),("Employment",0.0),("Exempt Capital",200.0),("Independent",-6000.0),("Other",-100000.0),("Rents",70000.0),("Trade",0.0)])]
RUNNING - offsetLosses_2_3_3 printed sc
RUNNING - squashCats
RUNNING - ordinaryPayable
*** step 1

#+begin_example
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     270000                0                  30000            0               
Capital         0                     0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  100                   0                  100              0               
Independent     0                     6000               0                0               
Other           0                     100000             0                0               
Rents           0                     2150               72150            0               
Trade           0                     0                  0                0               

#+end_example

*** step 2

#+begin_example
                combined income  special expenses
Agriculture     300000           0               
Capital         0                0               
Employment      0                0               
Exempt Capital  200              0               
Independent     -6000            0               
Other           -100000          0               
Rents           70000            0               
Trade           0                0               

#+end_example

*** step 3

#+begin_example
                net income
Agriculture     300000    
Capital         0         
Employment      0         
Exempt Capital  200       
Independent     -6000     
Other           -100000   
Rents           70000     
Trade           0         

#+end_example

*** step 4

#+begin_example
                total taxable income
Agriculture     257050              
Capital         0                   
Employment      0                   
Exempt Capital  171                 
Independent     0                   
Other           0                   
Rents           59978               
Trade           0                   

#+end_example

*** step 5

#+begin_example
       total taxable income
total  317029              

#+end_example

*** step 6

#+begin_example
       total tax payable  total taxable income
total  124355             317029              

#+end_example

** explaining section_2_3: 1a
- squashIncomes :: for Agriculture, extraordinary 270000.0 + ordinary 30000.0 - expenses 0.0 = pre-net 300000.0
- squashIncomes :: for Exempt Capital, extraordinary 100.0 + ordinary 100.0 - expenses 0.0 = pre-net 200.0
- offsetLosses_2_3_3 :: sum of the positive incomes 370200.0 exceeds 100000
- offsetLosses_2_3_3 :: so we will limit deductions to half of the sum of the negative incomes -106000.0 = -53000.0
- offsetLosses_2_3_3 :: and apply them pro rata to the positive incomes
- offsetLosses_2_3_3 :: reductio = 0.8568342
- offsetLosses_2_3_3 :: Agriculture 300000.0 is positive, multiplying by 0.8568342 = 257050.25
- offsetLosses_2_3_3 :: Exempt Capital 200.0 is positive, multiplying by 0.8568342 = 171.36684
- offsetLosses_2_3_3 :: Independent is negative, resetting to 0
- offsetLosses_2_3_3 :: Other is negative, resetting to 0
- offsetLosses_2_3_3 :: Rents 70000.0 is positive, multiplying by 0.8568342 = 59978.39

** executing section_34_1: 1a
** executing section 34.1
RUNNING - metaFsc preNetIncome
RUNNING - offsetLosses
RUNNING - squashCats
RUNNING - extraordinary
RUNNING - sentence3
RUNNING - totalPayable
*** step 1

#+begin_example
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     270000                0                  30000            0               
Capital         0                     0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  100                   0                  100              0               
Independent     0                     6000               0                0               
Other           0                     100000             0                0               
Rents           0                     2150               72150            0               
Trade           0                     0                  0                0               

#+end_example

*** step 2

#+begin_example
                extraordinary income  pre-net income
Agriculture     270000                30000         
Capital         0                     0             
Employment      0                     0             
Exempt Capital  100                   100           
Independent     0                     -6000         
Other           0                     -100000       
Rents           0                     70000         
Trade           0                     0             

#+end_example

*** step 3

#+begin_example
                extraordinary income  remaining taxable income
Agriculture     270000                -1768                   
Capital         0                     0                       
Employment      0                     0                       
Exempt Capital  100                   -6                      
Independent     0                     0                       
Other           0                     0                       
Rents           0                     -4126                   
Trade           0                     0                       

#+end_example

*** step 4

#+begin_example
       extraordinary income  remaining taxable income
total  270000                -5894                   

#+end_example

