doc/ex-de-20221220/detax/out.html
<div id="outline-container-orgb0c50bb" class="outline-3">
<h3 id="orgb0c50bb"><span class="section-number-3">22.1</span> executing section 2.3</h3>
<div class="outline-text-3" id="text-22-1">
<p>
RUNNING - metaFsc squashIncomes
270000.0
100.0
RETURNING - metaFsc squashIncomes
RUNNING - metaFsc netIncome
fromList [("net income",fromList [("Agriculture",300000.0),("Capital",0.0),("Employment",0.0),("Exempt Capital",200.0),("Independent",-6000.0),("Other",-100000.0),("Rents",70000.0),("Trade",0.0)])]
RETURNING - metaFsc netIncome
RUNNING - offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub>
fromList [("net income",fromList [("Agriculture",300000.0),("Capital",0.0),("Employment",0.0),("Exempt Capital",200.0),("Independent",-6000.0),("Other",-100000.0),("Rents",70000.0),("Trade",0.0)])]
RUNNING - offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub> printed sc
RUNNING - squashCats
RUNNING - ordinaryPayable
</p>
</div>
<div id="outline-container-org86115f7" class="outline-4">
<h4 id="org86115f7"><span class="section-number-4">22.1.1</span> step 1</h4>
<div class="outline-text-4" id="text-22-1-1">
<pre class="example" id="org9add857">
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     270000                0                  30000            0               
Capital         0                     0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  100                   0                  100              0               
Independent     0                     6000               0                0               
Other           0                     100000             0                0               
Rents           0                     2150               72150            0               
Trade           0                     0                  0                0               

</pre>
</div>
</div>

<div id="outline-container-orgf2689a1" class="outline-4">
<h4 id="orgf2689a1"><span class="section-number-4">22.1.2</span> step 2</h4>
<div class="outline-text-4" id="text-22-1-2">
<pre class="example" id="org14a69ee">
                combined income  special expenses
Agriculture     300000           0               
Capital         0                0               
Employment      0                0               
Exempt Capital  200              0               
Independent     -6000            0               
Other           -100000          0               
Rents           70000            0               
Trade           0                0               

</pre>
</div>
</div>

<div id="outline-container-org649ce11" class="outline-4">
<h4 id="org649ce11"><span class="section-number-4">22.1.3</span> step 3</h4>
<div class="outline-text-4" id="text-22-1-3">
<pre class="example" id="org954015d">
                net income
Agriculture     300000    
Capital         0         
Employment      0         
Exempt Capital  200       
Independent     -6000     
Other           -100000   
Rents           70000     
Trade           0         

</pre>
</div>
</div>

<div id="outline-container-orgde53af7" class="outline-4">
<h4 id="orgde53af7"><span class="section-number-4">22.1.4</span> step 4</h4>
<div class="outline-text-4" id="text-22-1-4">
<pre class="example" id="org825b47a">
                total taxable income
Agriculture     257050              
Capital         0                   
Employment      0                   
Exempt Capital  171                 
Independent     0                   
Other           0                   
Rents           59978               
Trade           0                   

</pre>
</div>
</div>

<div id="outline-container-org4483b35" class="outline-4">
<h4 id="org4483b35"><span class="section-number-4">22.1.5</span> step 5</h4>
<div class="outline-text-4" id="text-22-1-5">
<pre class="example" id="org4748674">
       total taxable income
total  317029              

</pre>
</div>
</div>

<div id="outline-container-org214006a" class="outline-4">
<h4 id="org214006a"><span class="section-number-4">22.1.6</span> step 6</h4>
<div class="outline-text-4" id="text-22-1-6">
<pre class="example" id="orgd637fd5">
       total tax payable  total taxable income
total  124355             317029              

</pre>
</div>
</div>
</div>

<div id="outline-container-org7454634" class="outline-3">
<h3 id="org7454634"><span class="section-number-3">22.2</span> explaining section<sub>2</sub><sub>3</sub>: 1a</h3>
<div class="outline-text-3" id="text-22-2">
<dl class="org-dl">
<dt>squashIncomes</dt><dd>for Agriculture, extraordinary 270000.0 + ordinary 30000.0 - expenses 0.0 = pre-net 300000.0</dd>
<dt>squashIncomes</dt><dd>for Exempt Capital, extraordinary 100.0 + ordinary 100.0 - expenses 0.0 = pre-net 200.0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>sum of the positive incomes 370200.0 exceeds 100000</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>so we will limit deductions to half of the sum of the negative incomes -106000.0 = -53000.0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>and apply them pro rata to the positive incomes</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>reductio = 0.8568342</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Agriculture 300000.0 is positive, multiplying by 0.8568342 = 257050.25</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Exempt Capital 200.0 is positive, multiplying by 0.8568342 = 171.36684</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Independent is negative, resetting to 0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Other is negative, resetting to 0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Rents 70000.0 is positive, multiplying by 0.8568342 = 59978.39</dd>
</dl>
</div>
</div>

<div id="outline-container-org7c1769c" class="outline-3">
<h3 id="org7c1769c"><span class="section-number-3">22.3</span> executing section<sub>34</sub><sub>1</sub>: 1a</h3>
</div>
<div id="outline-container-orgafc5361" class="outline-3">
<h3 id="orgafc5361"><span class="section-number-3">22.4</span> executing section 34.1</h3>
<div class="outline-text-3" id="text-22-4">
<p>
RUNNING - metaFsc preNetIncome
RUNNING - offsetLosses
RUNNING - squashCats
RUNNING - extraordinary
RUNNING - sentence3
RUNNING - totalPayable
</p>
</div>
<div id="outline-container-org9ee7a9f" class="outline-4">
<h4 id="org9ee7a9f"><span class="section-number-4">22.4.1</span> step 1</h4>
<div class="outline-text-4" id="text-22-4-1">
<pre class="example" id="orge74373d">
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     270000                0                  30000            0               
Capital         0                     0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  100                   0                  100              0               
Independent     0                     6000               0                0               
Other           0                     100000             0                0               
Rents           0                     2150               72150            0               
Trade           0                     0                  0                0               

</pre>
</div>
</div>

<div id="outline-container-orgb8be8d4" class="outline-4">
<h4 id="orgb8be8d4"><span class="section-number-4">22.4.2</span> step 2</h4>
<div class="outline-text-4" id="text-22-4-2">
<pre class="example" id="org673d46a">
                extraordinary income  pre-net income
Agriculture     270000                30000         
Capital         0                     0             
Employment      0                     0             
Exempt Capital  100                   100           
Independent     0                     -6000         
Other           0                     -100000       
Rents           0                     70000         
Trade           0                     0             

</pre>
</div>
</div>

<div id="outline-container-orgf174a09" class="outline-4">
<h4 id="orgf174a09"><span class="section-number-4">22.4.3</span> step 3</h4>
<div class="outline-text-4" id="text-22-4-3">
<pre class="example" id="orgdddb34d">
                extraordinary income  remaining taxable income
Agriculture     270000                -1768                   
Capital         0                     0                       
Employment      0                     0                       
Exempt Capital  100                   -6                      
Independent     0                     0                       
Other           0                     0                       
Rents           0                     -4126                   
Trade           0                     0                       

</pre>
</div>
</div>

<div id="outline-container-orgc4f4ec6" class="outline-4">
<h4 id="orgc4f4ec6"><span class="section-number-4">22.4.4</span> step 4</h4>
<div class="outline-text-4" id="text-22-4-4">
<pre class="example" id="org332e2d4">
       extraordinary income  remaining taxable income
total  270000                -5894                   

</pre>
</div>
</div>
