doc/ex-de-20221220/detax/out.org
*** step 5

#+begin_example
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  0               54000                 12857            12857         64283                     270000                -5894                     270000              

#+end_example

*** step 6

#+begin_example
       0 RTI is negative  1 RTI taxation  1 revised RTI taxation due to sentence 3  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  1                  0               62020                                     54000                 12857            12857         64283                     270000                -5894                     270000              

#+end_example

*** step 7

#+begin_example
       0 RTI is negative  1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  1                  62020           54000                 12857            12857         64283                     270000                -5894                     270000              

#+end_example

*** step 8

#+begin_example
       0 RTI is negative  total tax payable  total taxable income
total  1                  126303             270000              

#+end_example

* running scenario: 1b
** executing section 2.3
RUNNING - metaFsc squashIncomes
RETURNING - metaFsc squashIncomes
RUNNING - metaFsc netIncome
fromList [("net income",fromList [("Agriculture",20000.0),("Capital",0.0),("Employment",0.0),("Exempt Capital",100.0),("Independent",-6000.0),("Other",-60000.0),("Rents",70000.0),("Trade",0.0)])]
RETURNING - metaFsc netIncome
RUNNING - offsetLosses_2_3_3
fromList [("net income",fromList [("Agriculture",20000.0),("Capital",0.0),("Employment",0.0),("Exempt Capital",100.0),("Independent",-6000.0),("Other",-60000.0),("Rents",70000.0),("Trade",0.0)])]
RUNNING - offsetLosses_2_3_3 printed sc
RUNNING - squashCats
RUNNING - ordinaryPayable
*** step 1

#+begin_example
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     0                     0                  20000            0               
Capital         0                     0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  0                     0                  100              0               
Independent     0                     6000               0                0               
Other           0                     60000              0                0               
Rents           0                     2150               72150            0               
Trade           0                     0                  0                0               

#+end_example

*** step 2

#+begin_example
                combined income  special expenses
Agriculture     20000            0               
Capital         0                0               
Employment      0                0               
Exempt Capital  100              0               
Independent     -6000            0               
Other           -60000           0               
Rents           70000            0               
Trade           0                0               

#+end_example

*** step 3

#+begin_example
                net income
Agriculture     20000     
Capital         0         
Employment      0         
Exempt Capital  100       
Independent     -6000     
Other           -60000    
Rents           70000     
Trade           0         

#+end_example

*** step 4

#+begin_example
                total taxable income
Agriculture     5350                
Capital         0                   
Employment      0                   
Exempt Capital  27                  
Independent     0                   
Other           0                   
Rents           18724               
Trade           0                   

#+end_example

*** step 5

#+begin_example
       total taxable income
total  24073               

#+end_example

*** step 6

#+begin_example
       total tax payable  total taxable income
total  3027               24073               

#+end_example

** explaining section_2_3: 1b
- offsetLosses_2_3_3 :: sum of the positive incomes 90100.0 is less than 100000
- offsetLosses_2_3_3 :: so we will not limit deductions to half of the sum of the negative incomes; the deductible amount will be -66000.0
- offsetLosses_2_3_3 :: we will apply deductions pro rata to the positive incomes
- offsetLosses_2_3_3 :: reductio = 0.26748055
- offsetLosses_2_3_3 :: Agriculture 20000.0 is positive, multiplying by 0.26748055 = 5349.611
- offsetLosses_2_3_3 :: Exempt Capital 100.0 is positive, multiplying by 0.26748055 = 26.748055
- offsetLosses_2_3_3 :: Independent is negative, resetting to 0
- offsetLosses_2_3_3 :: Other is negative, resetting to 0
- offsetLosses_2_3_3 :: Rents 70000.0 is positive, multiplying by 0.26748055 = 18723.639

** executing section_34_1: 1b
** executing section 34.1
RUNNING - metaFsc preNetIncome
RUNNING - offsetLosses
RUNNING - squashCats
RUNNING - extraordinary
RUNNING - sentence3
ERROR - runReplaceSc: sanity check failed on keys 1 revised RTI taxation due to sentence 3
RUNNING - totalPayable
*** step 1

#+begin_example
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     0                     0                  20000            0               
Capital         0                     0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  0                     0                  100              0               
Independent     0                     6000               0                0               
Other           0                     60000              0                0               
Rents           0                     2150               72150            0               
Trade           0                     0                  0                0               

#+end_example

