doc/ex-de-20221220/detax/out.html

<div id="outline-container-org4fbd0ae" class="outline-4">
<h4 id="org4fbd0ae"><span class="section-number-4">22.4.5</span> step 5</h4>
<div class="outline-text-4" id="text-22-4-5">
<pre class="example" id="orgeca97fc">
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  0               54000                 12857            12857         64283                     270000                -5894                     270000              

</pre>
</div>
</div>

<div id="outline-container-orgfdfc472" class="outline-4">
<h4 id="orgfdfc472"><span class="section-number-4">22.4.6</span> step 6</h4>
<div class="outline-text-4" id="text-22-4-6">
<pre class="example" id="orgef7005b">
       0 RTI is negative  1 RTI taxation  1 revised RTI taxation due to sentence 3  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  1                  0               62020                                     54000                 12857            12857         64283                     270000                -5894                     270000              

</pre>
</div>
</div>

<div id="outline-container-orgf195d85" class="outline-4">
<h4 id="orgf195d85"><span class="section-number-4">22.4.7</span> step 7</h4>
<div class="outline-text-4" id="text-22-4-7">
<pre class="example" id="org5dae4c2">
       0 RTI is negative  1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  1                  62020           54000                 12857            12857         64283                     270000                -5894                     270000              

</pre>
</div>
</div>

<div id="outline-container-org925561e" class="outline-4">
<h4 id="org925561e"><span class="section-number-4">22.4.8</span> step 8</h4>
<div class="outline-text-4" id="text-22-4-8">
<pre class="example" id="orgaa15acd">
       0 RTI is negative  total tax payable  total taxable income
total  1                  126303             270000              

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgce5059f" class="outline-2">
<h2 id="orgce5059f"><span class="section-number-2">23</span> running scenario: 1b</h2>
<div class="outline-text-2" id="text-23">
</div>
<div id="outline-container-org577a461" class="outline-3">
<h3 id="org577a461"><span class="section-number-3">23.1</span> executing section 2.3</h3>
<div class="outline-text-3" id="text-23-1">
<p>
RUNNING - metaFsc squashIncomes
RETURNING - metaFsc squashIncomes
RUNNING - metaFsc netIncome
fromList [("net income",fromList [("Agriculture",20000.0),("Capital",0.0),("Employment",0.0),("Exempt Capital",100.0),("Independent",-6000.0),("Other",-60000.0),("Rents",70000.0),("Trade",0.0)])]
RETURNING - metaFsc netIncome
RUNNING - offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub>
fromList [("net income",fromList [("Agriculture",20000.0),("Capital",0.0),("Employment",0.0),("Exempt Capital",100.0),("Independent",-6000.0),("Other",-60000.0),("Rents",70000.0),("Trade",0.0)])]
RUNNING - offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub> printed sc
RUNNING - squashCats
RUNNING - ordinaryPayable
</p>
</div>
<div id="outline-container-orgc3b47be" class="outline-4">
<h4 id="orgc3b47be"><span class="section-number-4">23.1.1</span> step 1</h4>
<div class="outline-text-4" id="text-23-1-1">
<pre class="example" id="orge11f1c9">
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     0                     0                  20000            0               
Capital         0                     0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  0                     0                  100              0               
Independent     0                     6000               0                0               
Other           0                     60000              0                0               
Rents           0                     2150               72150            0               
Trade           0                     0                  0                0               

</pre>
</div>
</div>

<div id="outline-container-orgca3a947" class="outline-4">
<h4 id="orgca3a947"><span class="section-number-4">23.1.2</span> step 2</h4>
<div class="outline-text-4" id="text-23-1-2">
<pre class="example" id="orgd6ca2a8">
                combined income  special expenses
Agriculture     20000            0               
Capital         0                0               
Employment      0                0               
Exempt Capital  100              0               
Independent     -6000            0               
Other           -60000           0               
Rents           70000            0               
Trade           0                0               

</pre>
</div>
</div>

<div id="outline-container-org8efabe0" class="outline-4">
<h4 id="org8efabe0"><span class="section-number-4">23.1.3</span> step 3</h4>
<div class="outline-text-4" id="text-23-1-3">
<pre class="example" id="orgfc7f92a">
                net income
Agriculture     20000     
Capital         0         
Employment      0         
Exempt Capital  100       
Independent     -6000     
Other           -60000    
Rents           70000     
Trade           0         

</pre>
</div>
</div>

<div id="outline-container-orgc9609f3" class="outline-4">
<h4 id="orgc9609f3"><span class="section-number-4">23.1.4</span> step 4</h4>
<div class="outline-text-4" id="text-23-1-4">
<pre class="example" id="org83a9918">
                total taxable income
Agriculture     5350                
Capital         0                   
Employment      0                   
Exempt Capital  27                  
Independent     0                   
Other           0                   
Rents           18724               
Trade           0                   

</pre>
</div>
</div>

<div id="outline-container-org3c0988d" class="outline-4">
<h4 id="org3c0988d"><span class="section-number-4">23.1.5</span> step 5</h4>
<div class="outline-text-4" id="text-23-1-5">
<pre class="example" id="org4b412b0">
       total taxable income
total  24073               

</pre>
</div>
</div>

<div id="outline-container-orgce49c4a" class="outline-4">
<h4 id="orgce49c4a"><span class="section-number-4">23.1.6</span> step 6</h4>
<div class="outline-text-4" id="text-23-1-6">
<pre class="example" id="orgc73e160">
       total tax payable  total taxable income
total  3027               24073               

</pre>
</div>
</div>
</div>

<div id="outline-container-org70067c1" class="outline-3">
<h3 id="org70067c1"><span class="section-number-3">23.2</span> explaining section<sub>2</sub><sub>3</sub>: 1b</h3>
<div class="outline-text-3" id="text-23-2">
<dl class="org-dl">
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>sum of the positive incomes 90100.0 is less than 100000</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>so we will not limit deductions to half of the sum of the negative incomes; the deductible amount will be -66000.0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>we will apply deductions pro rata to the positive incomes</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>reductio = 0.26748055</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Agriculture 20000.0 is positive, multiplying by 0.26748055 = 5349.611</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Exempt Capital 100.0 is positive, multiplying by 0.26748055 = 26.748055</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Independent is negative, resetting to 0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Other is negative, resetting to 0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Rents 70000.0 is positive, multiplying by 0.26748055 = 18723.639</dd>
</dl>
</div>
</div>

<div id="outline-container-org74c1a97" class="outline-3">
<h3 id="org74c1a97"><span class="section-number-3">23.3</span> executing section<sub>34</sub><sub>1</sub>: 1b</h3>
</div>
