doc/ex-de-20221220/detax/out.org
** explaining section_2_3: 2
- squashIncomes :: for Agriculture, extraordinary 270000.0 + ordinary 30000.0 - expenses 0.0 = pre-net 300000.0
- squashIncomes :: for Exempt Capital, extraordinary 100.0 + ordinary 100.0 - expenses 0.0 = pre-net 200.0
- offsetLosses_2_3_3 :: sum of the positive incomes 370200.0 exceeds 100000
- offsetLosses_2_3_3 :: so we will limit deductions to half of the sum of the negative incomes -6000.0 = -3000.0
- offsetLosses_2_3_3 :: and apply them pro rata to the positive incomes
- offsetLosses_2_3_3 :: reductio = 0.9918963
- offsetLosses_2_3_3 :: Agriculture 300000.0 is positive, multiplying by 0.9918963 = 297568.88
- offsetLosses_2_3_3 :: Exempt Capital 200.0 is positive, multiplying by 0.9918963 = 198.37926
- offsetLosses_2_3_3 :: Independent is negative, resetting to 0
- offsetLosses_2_3_3 :: Rents 70000.0 is positive, multiplying by 0.9918963 = 69432.74

** executing section_34_1: 2
** executing section 34.1
RUNNING - metaFsc preNetIncome
RUNNING - offsetLosses
RUNNING - squashCats
RUNNING - extraordinary
RUNNING - sentence3
ERROR - runReplaceSc: sanity check failed on keys 1 revised RTI taxation due to sentence 3
RUNNING - totalPayable
*** step 1

#+begin_example
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     270000                0                  30000            0               
Capital         0                     0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  100                   0                  100              0               
Independent     0                     6000               0                0               
Other           0                     0                  0                0               
Rents           0                     2150               72150            0               
Trade           0                     0                  0                0               

#+end_example

*** step 2

#+begin_example
                extraordinary income  pre-net income
Agriculture     270000                30000         
Capital         0                     0             
Employment      0                     0             
Exempt Capital  100                   100           
Independent     0                     -6000         
Other           0                     0             
Rents           0                     70000         
Trade           0                     0             

#+end_example

*** step 3

#+begin_example
                extraordinary income  remaining taxable income
Agriculture     270000                28202                   
Capital         0                     0                       
Employment      0                     0                       
Exempt Capital  100                   94                      
Independent     0                     0                       
Other           0                     0                       
Rents           0                     65804                   
Trade           0                     0                       

#+end_example

*** step 4

#+begin_example
       extraordinary income  remaining taxable income
total  270000                94006                   

#+end_example

*** step 5

#+begin_example
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  29510           148006                52190            22680         113400                    270000                94006                     364006              

#+end_example

*** step 6

#+begin_example
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  29510           148006                52190            22680         113400                    270000                94006                     364006              

#+end_example

*** step 7

#+begin_example
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  29510           148006                52190            22680         113400                    270000                94006                     364006              

#+end_example

*** step 8

#+begin_example
       total tax payable  total taxable income
total  142910             364006              

#+end_example

* running scenario: test case 1
** executing section 2.3
RUNNING - metaFsc squashIncomes
25000.0
RETURNING - metaFsc squashIncomes
RUNNING - metaFsc netIncome
fromList [("net income",fromList [("Agriculture",0.0),("Capital",0.0),("Employment",0.0),("Exempt Capital",0.0),("Independent",0.0),("Other",0.0),("Rents",97150.0),("Trade",0.0)])]
RETURNING - metaFsc netIncome
RUNNING - offsetLosses_2_3_3
fromList [("net income",fromList [("Agriculture",0.0),("Capital",0.0),("Employment",0.0),("Exempt Capital",0.0),("Independent",0.0),("Other",0.0),("Rents",97150.0),("Trade",0.0)])]
RUNNING - offsetLosses_2_3_3 printed sc
RUNNING - squashCats
RUNNING - ordinaryPayable
*** step 1

#+begin_example
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     0                     0                  0                0               
Capital         0                     0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  0                     0                  0                0               
Independent     0                     0                  0                0               
Other           0                     0                  0                0               
Rents           25000                 0                  72150            0               
Trade           0                     0                  0                0               

#+end_example

*** step 2

#+begin_example
                combined income  special expenses
Agriculture     0                0               
Capital         0                0               
Employment      0                0               
Exempt Capital  0                0               
Independent     0                0               
Other           0                0               
Rents           97150            0               
Trade           0                0               

#+end_example

*** step 3

#+begin_example
                net income
Agriculture     0         
Capital         0         
Employment      0         
Exempt Capital  0         
Independent     0         
Other           0         
Rents           97150     
Trade           0         

#+end_example

*** step 4

#+begin_example
                total taxable income
Agriculture     0                   
Capital         0                   
Employment      0                   
Exempt Capital  0                   
Independent     0                   
Other           0                   
Rents           97150               
Trade           0                   

#+end_example

*** step 5

#+begin_example
       total taxable income
total  97150               

#+end_example

*** step 6

#+begin_example
       total tax payable  total taxable income
total  30830              97150               

#+end_example

