doc/ex-de-20221220/detax/out.html

<div id="outline-container-org71ac085" class="outline-3">
<h3 id="org71ac085"><span class="section-number-3">24.2</span> explaining section<sub>2</sub><sub>3</sub>: 2</h3>
<div class="outline-text-3" id="text-24-2">
<dl class="org-dl">
<dt>squashIncomes</dt><dd>for Agriculture, extraordinary 270000.0 + ordinary 30000.0 - expenses 0.0 = pre-net 300000.0</dd>
<dt>squashIncomes</dt><dd>for Exempt Capital, extraordinary 100.0 + ordinary 100.0 - expenses 0.0 = pre-net 200.0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>sum of the positive incomes 370200.0 exceeds 100000</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>so we will limit deductions to half of the sum of the negative incomes -6000.0 = -3000.0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>and apply them pro rata to the positive incomes</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>reductio = 0.9918963</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Agriculture 300000.0 is positive, multiplying by 0.9918963 = 297568.88</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Exempt Capital 200.0 is positive, multiplying by 0.9918963 = 198.37926</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Independent is negative, resetting to 0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Rents 70000.0 is positive, multiplying by 0.9918963 = 69432.74</dd>
</dl>
</div>
</div>

<div id="outline-container-orgd511679" class="outline-3">
<h3 id="orgd511679"><span class="section-number-3">24.3</span> executing section<sub>34</sub><sub>1</sub>: 2</h3>
</div>
<div id="outline-container-orgb5f90b1" class="outline-3">
<h3 id="orgb5f90b1"><span class="section-number-3">24.4</span> executing section 34.1</h3>
<div class="outline-text-3" id="text-24-4">
<p>
RUNNING - metaFsc preNetIncome
RUNNING - offsetLosses
RUNNING - squashCats
RUNNING - extraordinary
RUNNING - sentence3
ERROR - runReplaceSc: sanity check failed on keys 1 revised RTI taxation due to sentence 3
RUNNING - totalPayable
</p>
</div>
<div id="outline-container-org092d3dd" class="outline-4">
<h4 id="org092d3dd"><span class="section-number-4">24.4.1</span> step 1</h4>
<div class="outline-text-4" id="text-24-4-1">
<pre class="example" id="org7b95326">
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     270000                0                  30000            0               
Capital         0                     0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  100                   0                  100              0               
Independent     0                     6000               0                0               
Other           0                     0                  0                0               
Rents           0                     2150               72150            0               
Trade           0                     0                  0                0               

</pre>
</div>
</div>

<div id="outline-container-org090b429" class="outline-4">
<h4 id="org090b429"><span class="section-number-4">24.4.2</span> step 2</h4>
<div class="outline-text-4" id="text-24-4-2">
<pre class="example" id="org2893bfa">
                extraordinary income  pre-net income
Agriculture     270000                30000         
Capital         0                     0             
Employment      0                     0             
Exempt Capital  100                   100           
Independent     0                     -6000         
Other           0                     0             
Rents           0                     70000         
Trade           0                     0             

</pre>
</div>
</div>

<div id="outline-container-orge8dade8" class="outline-4">
<h4 id="orge8dade8"><span class="section-number-4">24.4.3</span> step 3</h4>
<div class="outline-text-4" id="text-24-4-3">
<pre class="example" id="org5585a0d">
                extraordinary income  remaining taxable income
Agriculture     270000                28202                   
Capital         0                     0                       
Employment      0                     0                       
Exempt Capital  100                   94                      
Independent     0                     0                       
Other           0                     0                       
Rents           0                     65804                   
Trade           0                     0                       

</pre>
</div>
</div>

<div id="outline-container-orgab8bcc3" class="outline-4">
<h4 id="orgab8bcc3"><span class="section-number-4">24.4.4</span> step 4</h4>
<div class="outline-text-4" id="text-24-4-4">
<pre class="example" id="org0a96f09">
       extraordinary income  remaining taxable income
total  270000                94006                   

</pre>
</div>
</div>

<div id="outline-container-org0ef157a" class="outline-4">
<h4 id="org0ef157a"><span class="section-number-4">24.4.5</span> step 5</h4>
<div class="outline-text-4" id="text-24-4-5">
<pre class="example" id="org4a0ccb5">
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  29510           148006                52190            22680         113400                    270000                94006                     364006              

</pre>
</div>
</div>

<div id="outline-container-org1cedf58" class="outline-4">
<h4 id="org1cedf58"><span class="section-number-4">24.4.6</span> step 6</h4>
<div class="outline-text-4" id="text-24-4-6">
<pre class="example" id="orgfed84a6">
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  29510           148006                52190            22680         113400                    270000                94006                     364006              

</pre>
</div>
</div>

<div id="outline-container-org11309c0" class="outline-4">
<h4 id="org11309c0"><span class="section-number-4">24.4.7</span> step 7</h4>
<div class="outline-text-4" id="text-24-4-7">
<pre class="example" id="org283bb73">
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  29510           148006                52190            22680         113400                    270000                94006                     364006              

</pre>
</div>
</div>

<div id="outline-container-orgd7d3c9e" class="outline-4">
<h4 id="orgd7d3c9e"><span class="section-number-4">24.4.8</span> step 8</h4>
<div class="outline-text-4" id="text-24-4-8">
<pre class="example" id="orge4c18ca">
       total tax payable  total taxable income
total  142910             364006              

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5b3c587" class="outline-2">
<h2 id="org5b3c587"><span class="section-number-2">25</span> running scenario: test case 1</h2>
<div class="outline-text-2" id="text-25">
</div>
