doc/ex-de-20221220/detax/out.org
** explaining section_2_3: test case 1
- squashIncomes :: for Rents, extraordinary 25000.0 + ordinary 72150.0 - expenses 0.0 = pre-net 97150.0
- offsetLosses_2_3_3 :: sum of the positive incomes 97150.0 is less than 100000
- offsetLosses_2_3_3 :: so we will not limit deductions to half of the sum of the negative incomes; the deductible amount will be 0.0
- offsetLosses_2_3_3 :: we will apply deductions pro rata to the positive incomes
- offsetLosses_2_3_3 :: reductio = 1.0
- offsetLosses_2_3_3 :: Rents 97150.0 is positive, multiplying by 1.0 = 97150.0

** executing section_34_1: test case 1
** executing section 34.1
RUNNING - metaFsc preNetIncome
RUNNING - offsetLosses
RUNNING - squashCats
RUNNING - extraordinary
RUNNING - sentence3
ERROR - runReplaceSc: sanity check failed on keys 1 revised RTI taxation due to sentence 3
RUNNING - totalPayable
*** step 1

#+begin_example
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     0                     0                  0                0               
Capital         0                     0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  0                     0                  0                0               
Independent     0                     0                  0                0               
Other           0                     0                  0                0               
Rents           25000                 0                  72150            0               
Trade           0                     0                  0                0               

#+end_example

*** step 2

#+begin_example
                extraordinary income  pre-net income
Agriculture     0                     0             
Capital         0                     0             
Employment      0                     0             
Exempt Capital  0                     0             
Independent     0                     0             
Other           0                     0             
Rents           25000                 72150         
Trade           0                     0             

#+end_example

*** step 3

#+begin_example
                extraordinary income  remaining taxable income
Agriculture     0                     0                       
Capital         0                     0                       
Employment      0                     0                       
Exempt Capital  0                     0                       
Independent     0                     0                       
Other           0                     0                       
Rents           25000                 72150                   
Trade           0                     0                       

#+end_example

*** step 4

#+begin_example
       extraordinary income  remaining taxable income
total  25000                 72150                   

#+end_example

*** step 5

#+begin_example
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  20330           77150                 22430            2100          10500                     25000                 72150                     97150               

#+end_example

*** step 6

#+begin_example
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  20330           77150                 22430            2100          10500                     25000                 72150                     97150               

#+end_example

*** step 7

#+begin_example
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  20330           77150                 22430            2100          10500                     25000                 72150                     97150               

#+end_example

*** step 8

#+begin_example
       total tax payable  total taxable income
total  30830              97150               

#+end_example

* running scenario: test case 2
