doc/ex-de-20221220/detax/out.html
<div id="outline-container-orga957240" class="outline-3">
<h3 id="orga957240"><span class="section-number-3">25.1</span> executing section 2.3</h3>
<div class="outline-text-3" id="text-25-1">
<p>
RUNNING - metaFsc squashIncomes
25000.0
RETURNING - metaFsc squashIncomes
RUNNING - metaFsc netIncome
fromList [("net income",fromList [("Agriculture",0.0),("Capital",0.0),("Employment",0.0),("Exempt Capital",0.0),("Independent",0.0),("Other",0.0),("Rents",97150.0),("Trade",0.0)])]
RETURNING - metaFsc netIncome
RUNNING - offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub>
fromList [("net income",fromList [("Agriculture",0.0),("Capital",0.0),("Employment",0.0),("Exempt Capital",0.0),("Independent",0.0),("Other",0.0),("Rents",97150.0),("Trade",0.0)])]
RUNNING - offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub> printed sc
RUNNING - squashCats
RUNNING - ordinaryPayable
</p>
</div>
<div id="outline-container-org1cc1a5b" class="outline-4">
<h4 id="org1cc1a5b"><span class="section-number-4">25.1.1</span> step 1</h4>
<div class="outline-text-4" id="text-25-1-1">
<pre class="example" id="org64a5a7f">
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     0                     0                  0                0               
Capital         0                     0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  0                     0                  0                0               
Independent     0                     0                  0                0               
Other           0                     0                  0                0               
Rents           25000                 0                  72150            0               
Trade           0                     0                  0                0               

</pre>
</div>
</div>

<div id="outline-container-org78bf2ab" class="outline-4">
<h4 id="org78bf2ab"><span class="section-number-4">25.1.2</span> step 2</h4>
<div class="outline-text-4" id="text-25-1-2">
<pre class="example" id="orgceb2d28">
                combined income  special expenses
Agriculture     0                0               
Capital         0                0               
Employment      0                0               
Exempt Capital  0                0               
Independent     0                0               
Other           0                0               
Rents           97150            0               
Trade           0                0               

</pre>
</div>
</div>

<div id="outline-container-org438ce7c" class="outline-4">
<h4 id="org438ce7c"><span class="section-number-4">25.1.3</span> step 3</h4>
<div class="outline-text-4" id="text-25-1-3">
<pre class="example" id="org97087f5">
                net income
Agriculture     0         
Capital         0         
Employment      0         
Exempt Capital  0         
Independent     0         
Other           0         
Rents           97150     
Trade           0         

</pre>
</div>
</div>

<div id="outline-container-org5a1128e" class="outline-4">
<h4 id="org5a1128e"><span class="section-number-4">25.1.4</span> step 4</h4>
<div class="outline-text-4" id="text-25-1-4">
<pre class="example" id="orga3e5c7d">
                total taxable income
Agriculture     0                   
Capital         0                   
Employment      0                   
Exempt Capital  0                   
Independent     0                   
Other           0                   
Rents           97150               
Trade           0                   

</pre>
</div>
</div>

<div id="outline-container-org3427169" class="outline-4">
<h4 id="org3427169"><span class="section-number-4">25.1.5</span> step 5</h4>
<div class="outline-text-4" id="text-25-1-5">
<pre class="example" id="org2a4e832">
       total taxable income
total  97150               

</pre>
</div>
</div>

<div id="outline-container-orgcb7dfbc" class="outline-4">
<h4 id="orgcb7dfbc"><span class="section-number-4">25.1.6</span> step 6</h4>
<div class="outline-text-4" id="text-25-1-6">
<pre class="example" id="org4db986b">
       total tax payable  total taxable income
total  30830              97150               

</pre>
</div>
</div>
</div>

<div id="outline-container-org279b878" class="outline-3">
<h3 id="org279b878"><span class="section-number-3">25.2</span> explaining section<sub>2</sub><sub>3</sub>: test case 1</h3>
<div class="outline-text-3" id="text-25-2">
<dl class="org-dl">
<dt>squashIncomes</dt><dd>for Rents, extraordinary 25000.0 + ordinary 72150.0 - expenses 0.0 = pre-net 97150.0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>sum of the positive incomes 97150.0 is less than 100000</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>so we will not limit deductions to half of the sum of the negative incomes; the deductible amount will be 0.0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>we will apply deductions pro rata to the positive incomes</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>reductio = 1.0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Rents 97150.0 is positive, multiplying by 1.0 = 97150.0</dd>
</dl>
</div>
</div>

<div id="outline-container-org56a725c" class="outline-3">
<h3 id="org56a725c"><span class="section-number-3">25.3</span> executing section<sub>34</sub><sub>1</sub>: test case 1</h3>
</div>
<div id="outline-container-org6ac8edc" class="outline-3">
<h3 id="org6ac8edc"><span class="section-number-3">25.4</span> executing section 34.1</h3>
<div class="outline-text-3" id="text-25-4">
<p>
RUNNING - metaFsc preNetIncome
RUNNING - offsetLosses
RUNNING - squashCats
RUNNING - extraordinary
RUNNING - sentence3
ERROR - runReplaceSc: sanity check failed on keys 1 revised RTI taxation due to sentence 3
RUNNING - totalPayable
</p>
</div>
<div id="outline-container-org413dd84" class="outline-4">
<h4 id="org413dd84"><span class="section-number-4">25.4.1</span> step 1</h4>
<div class="outline-text-4" id="text-25-4-1">
<pre class="example" id="orgedb4a2b">
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     0                     0                  0                0               
Capital         0                     0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  0                     0                  0                0               
Independent     0                     0                  0                0               
Other           0                     0                  0                0               
Rents           25000                 0                  72150            0               
Trade           0                     0                  0                0               

</pre>
</div>
</div>

<div id="outline-container-orgb685652" class="outline-4">
<h4 id="orgb685652"><span class="section-number-4">25.4.2</span> step 2</h4>
<div class="outline-text-4" id="text-25-4-2">
<pre class="example" id="orga67c9ea">
                extraordinary income  pre-net income
Agriculture     0                     0             
Capital         0                     0             
Employment      0                     0             
Exempt Capital  0                     0             
Independent     0                     0             
Other           0                     0             
Rents           25000                 72150         
Trade           0                     0             

</pre>
</div>
</div>

<div id="outline-container-org9dc80a9" class="outline-4">
<h4 id="org9dc80a9"><span class="section-number-4">25.4.3</span> step 3</h4>
<div class="outline-text-4" id="text-25-4-3">
<pre class="example" id="orge675479">
                extraordinary income  remaining taxable income
Agriculture     0                     0                       
Capital         0                     0                       
Employment      0                     0                       
Exempt Capital  0                     0                       
Independent     0                     0                       
Other           0                     0                       
Rents           25000                 72150                   
Trade           0                     0                       

</pre>
</div>
</div>

<div id="outline-container-orgd3474eb" class="outline-4">
<h4 id="orgd3474eb"><span class="section-number-4">25.4.4</span> step 4</h4>
<div class="outline-text-4" id="text-25-4-4">
<pre class="example" id="orgdee7afe">
       extraordinary income  remaining taxable income
total  25000                 72150                   

</pre>
</div>
</div>

<div id="outline-container-org36b60c5" class="outline-4">
<h4 id="org36b60c5"><span class="section-number-4">25.4.5</span> step 5</h4>
<div class="outline-text-4" id="text-25-4-5">
<pre class="example" id="orgc4d94fd">
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  20330           77150                 22430            2100          10500                     25000                 72150                     97150               

</pre>
</div>
</div>

<div id="outline-container-org6cc15dd" class="outline-4">
<h4 id="org6cc15dd"><span class="section-number-4">25.4.6</span> step 6</h4>
<div class="outline-text-4" id="text-25-4-6">
<pre class="example" id="org9ea7c31">
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  20330           77150                 22430            2100          10500                     25000                 72150                     97150               

</pre>
</div>
</div>

<div id="outline-container-org5276486" class="outline-4">
<h4 id="org5276486"><span class="section-number-4">25.4.7</span> step 7</h4>
<div class="outline-text-4" id="text-25-4-7">
<pre class="example" id="orgb3848f1">
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  20330           77150                 22430            2100          10500                     25000                 72150                     97150               

</pre>
</div>
</div>

<div id="outline-container-org95d98b6" class="outline-4">
<h4 id="org95d98b6"><span class="section-number-4">25.4.8</span> step 8</h4>
<div class="outline-text-4" id="text-25-4-8">
<pre class="example" id="org9c9461a">
       total tax payable  total taxable income
total  30830              97150               

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0f0a606" class="outline-2">
<h2 id="org0f0a606"><span class="section-number-2">26</span> running scenario: test case 2</h2>
<div class="outline-text-2" id="text-26">
</div>
