doc/ex-de-20221220/detax/out.org
** executing section 2.3
RUNNING - metaFsc squashIncomes
225000.0
RETURNING - metaFsc squashIncomes
RUNNING - metaFsc netIncome
fromList [("net income",fromList [("Agriculture",0.0),("Capital",225000.0),("Employment",0.0),("Exempt Capital",0.0),("Independent",0.0),("Other",0.0),("Rents",-48200.0),("Trade",5350.0)])]
RETURNING - metaFsc netIncome
RUNNING - offsetLosses_2_3_3
fromList [("net income",fromList [("Agriculture",0.0),("Capital",225000.0),("Employment",0.0),("Exempt Capital",0.0),("Independent",0.0),("Other",0.0),("Rents",-48200.0),("Trade",5350.0)])]
RUNNING - offsetLosses_2_3_3 printed sc
RUNNING - squashCats
RUNNING - ordinaryPayable
*** step 1

#+begin_example
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     0                     0                  0                0               
Capital         225000                0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  0                     0                  0                0               
Independent     0                     0                  0                0               
Other           0                     0                  0                0               
Rents           0                     45000              0                3200            
Trade           0                     0                  5350             0               

#+end_example

*** step 2

#+begin_example
                combined income  special expenses
Agriculture     0                0               
Capital         225000           0               
Employment      0                0               
Exempt Capital  0                0               
Independent     0                0               
Other           0                0               
Rents           -45000           3200            
Trade           5350             0               

#+end_example

*** step 3

#+begin_example
                net income
Agriculture     0         
Capital         225000    
Employment      0         
Exempt Capital  0         
Independent     0         
Other           0         
Rents           -48200    
Trade           5350      

#+end_example

*** step 4

#+begin_example
                total taxable income
Agriculture     0                   
Capital         201460              
Employment      0                   
Exempt Capital  0                   
Independent     0                   
Other           0                   
Rents           0                   
Trade           4790                

#+end_example

*** step 5

#+begin_example
       total taxable income
total  206250              

#+end_example

*** step 6

#+begin_example
       total tax payable  total taxable income
total  76652              206250              

#+end_example

** explaining section_2_3: test case 2
- squashIncomes :: for Capital, extraordinary 225000.0 + ordinary 0.0 - expenses 0.0 = pre-net 225000.0
- offsetLosses_2_3_3 :: sum of the positive incomes 230350.0 exceeds 100000
- offsetLosses_2_3_3 :: so we will limit deductions to half of the sum of the negative incomes -48200.0 = -24100.0
- offsetLosses_2_3_3 :: and apply them pro rata to the positive incomes
- offsetLosses_2_3_3 :: reductio = 0.8953766
- offsetLosses_2_3_3 :: Capital 225000.0 is positive, multiplying by 0.8953766 = 201459.73
- offsetLosses_2_3_3 :: Rents is negative, resetting to 0
- offsetLosses_2_3_3 :: Trade 5350.0 is positive, multiplying by 0.8953766 = 4790.265

** executing section_34_1: test case 2
** executing section 34.1
RUNNING - metaFsc preNetIncome
RUNNING - offsetLosses
RUNNING - squashCats
RUNNING - extraordinary
RUNNING - sentence3
RUNNING - totalPayable
*** step 1

#+begin_example
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     0                     0                  0                0               
Capital         225000                0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  0                     0                  0                0               
Independent     0                     0                  0                0               
Other           0                     0                  0                0               
Rents           0                     45000              0                3200            
Trade           0                     0                  5350             0               

#+end_example

*** step 2

#+begin_example
                extraordinary income  pre-net income
Agriculture     0                     0             
Capital         225000                0             
Employment      0                     0             
Exempt Capital  0                     0             
Independent     0                     0             
Other           0                     0             
Rents           0                     -48200        
Trade           0                     5350          

#+end_example

*** step 3

#+begin_example
                extraordinary income  remaining taxable income
Agriculture     0                     0                       
Capital         225000                0                       
Employment      0                     0                       
Exempt Capital  0                     0                       
Independent     0                     0                       
Other           0                     0                       
Rents           0                     0                       
Trade           0                     -42850                  

#+end_example

*** step 4

#+begin_example
       extraordinary income  remaining taxable income
total  225000                -42850                  

#+end_example

*** step 5

#+begin_example
       1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  0               45000                 9538             9538          47689                     225000                -42850                    225000              

#+end_example

*** step 6

#+begin_example
       0 RTI is negative  1 RTI taxation  1 revised RTI taxation due to sentence 3  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  1                  0               33339                                     45000                 9538             9538          47689                     225000                -42850                    225000              

#+end_example

*** step 7

#+begin_example
       0 RTI is negative  1 RTI taxation  2 RTI plus one fifth  3 tax on RTI+.2  4 difference  5 extraordinary taxation  extraordinary income  remaining taxable income  total taxable income
total  1                  33339           45000                 9538             9538          47689                     225000                -42850                    225000              

#+end_example

*** step 8

#+begin_example
       0 RTI is negative  total tax payable  total taxable income
total  1                  81028              225000              

#+end_example

* running scenario: test case 3
** executing section 2.3
RUNNING - metaFsc squashIncomes
225000.0
RETURNING - metaFsc squashIncomes
RUNNING - metaFsc netIncome
fromList [("net income",fromList [("Agriculture",0.0),("Capital",225000.0),("Employment",0.0),("Exempt Capital",0.0),("Independent",0.0),("Other",0.0),("Rents",-48200.0),("Trade",5350.0)])]
RETURNING - metaFsc netIncome
RUNNING - offsetLosses_2_3_3
fromList [("net income",fromList [("Agriculture",0.0),("Capital",225000.0),("Employment",0.0),("Exempt Capital",0.0),("Independent",0.0),("Other",0.0),("Rents",-48200.0),("Trade",5350.0)])]
RUNNING - offsetLosses_2_3_3 printed sc
RUNNING - squashCats
RUNNING - ordinaryPayable
*** step 1

#+begin_example
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     0                     0                  0                0               
Capital         225000                0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  0                     0                  0                0               
Independent     0                     0                  0                0               
Other           0                     0                  0                0               
Rents           0                     45000              0                3200            
Trade           0                     0                  5350             0               

#+end_example

*** step 2

#+begin_example
                combined income  special expenses
Agriculture     0                0               
Capital         225000           0               
Employment      0                0               
Exempt Capital  0                0               
Independent     0                0               
Other           0                0               
Rents           -45000           3200            
Trade           5350             0               

#+end_example

*** step 3

#+begin_example
                net income
Agriculture     0         
Capital         225000    
Employment      0         
Exempt Capital  0         
Independent     0         
Other           0         
Rents           -48200    
Trade           5350      

#+end_example

*** step 4

#+begin_example
                total taxable income
Agriculture     0                   
Capital         201460              
Employment      0                   
Exempt Capital  0                   
Independent     0                   
Other           0                   
Rents           0                   
Trade           4790                

#+end_example

