doc/ex-de-20221220/detax/out.html
<div id="outline-container-org363d37b" class="outline-3">
<h3 id="org363d37b"><span class="section-number-3">26.1</span> executing section 2.3</h3>
<div class="outline-text-3" id="text-26-1">
<p>
RUNNING - metaFsc squashIncomes
225000.0
RETURNING - metaFsc squashIncomes
RUNNING - metaFsc netIncome
fromList [("net income",fromList [("Agriculture",0.0),("Capital",225000.0),("Employment",0.0),("Exempt Capital",0.0),("Independent",0.0),("Other",0.0),("Rents",-48200.0),("Trade",5350.0)])]
RETURNING - metaFsc netIncome
RUNNING - offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub>
fromList [("net income",fromList [("Agriculture",0.0),("Capital",225000.0),("Employment",0.0),("Exempt Capital",0.0),("Independent",0.0),("Other",0.0),("Rents",-48200.0),("Trade",5350.0)])]
RUNNING - offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub> printed sc
RUNNING - squashCats
RUNNING - ordinaryPayable
</p>
</div>
<div id="outline-container-org7d785f4" class="outline-4">
<h4 id="org7d785f4"><span class="section-number-4">26.1.1</span> step 1</h4>
<div class="outline-text-4" id="text-26-1-1">
<pre class="example" id="orgcd6d4a8">
                extraordinary income  ordinary expenses  ordinary income  special expenses
Agriculture     0                     0                  0                0               
Capital         225000                0                  0                0               
Employment      0                     0                  0                0               
Exempt Capital  0                     0                  0                0               
Independent     0                     0                  0                0               
Other           0                     0                  0                0               
Rents           0                     45000              0                3200            
Trade           0                     0                  5350             0               

</pre>
</div>
</div>

<div id="outline-container-org5189a3e" class="outline-4">
<h4 id="org5189a3e"><span class="section-number-4">26.1.2</span> step 2</h4>
<div class="outline-text-4" id="text-26-1-2">
<pre class="example" id="orga7fe948">
                combined income  special expenses
Agriculture     0                0               
Capital         225000           0               
Employment      0                0               
Exempt Capital  0                0               
Independent     0                0               
Other           0                0               
Rents           -45000           3200            
Trade           5350             0               

</pre>
</div>
</div>

<div id="outline-container-org7aa1508" class="outline-4">
<h4 id="org7aa1508"><span class="section-number-4">26.1.3</span> step 3</h4>
<div class="outline-text-4" id="text-26-1-3">
<pre class="example" id="orgecccb36">
                net income
Agriculture     0         
Capital         225000    
Employment      0         
Exempt Capital  0         
Independent     0         
Other           0         
Rents           -48200    
Trade           5350      

</pre>
</div>
</div>

<div id="outline-container-org21c1601" class="outline-4">
<h4 id="org21c1601"><span class="section-number-4">26.1.4</span> step 4</h4>
<div class="outline-text-4" id="text-26-1-4">
<pre class="example" id="org7352dac">
                total taxable income
Agriculture     0                   
Capital         201460              
Employment      0                   
Exempt Capital  0                   
Independent     0                   
Other           0                   
Rents           0                   
Trade           4790                

</pre>
</div>
</div>

<div id="outline-container-org0564e58" class="outline-4">
<h4 id="org0564e58"><span class="section-number-4">26.1.5</span> step 5</h4>
<div class="outline-text-4" id="text-26-1-5">
<pre class="example" id="org1a85418">
       total taxable income
total  206250              

</pre>
</div>
</div>

<div id="outline-container-orgf50d430" class="outline-4">
<h4 id="orgf50d430"><span class="section-number-4">26.1.6</span> step 6</h4>
<div class="outline-text-4" id="text-26-1-6">
<pre class="example" id="orgfe9674f">
       total tax payable  total taxable income
total  76652              206250              

</pre>
</div>
</div>
</div>

<div id="outline-container-org8dd7712" class="outline-3">
<h3 id="org8dd7712"><span class="section-number-3">26.2</span> explaining section<sub>2</sub><sub>3</sub>: test case 2</h3>
<div class="outline-text-3" id="text-26-2">
<dl class="org-dl">
<dt>squashIncomes</dt><dd>for Capital, extraordinary 225000.0 + ordinary 0.0 - expenses 0.0 = pre-net 225000.0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>sum of the positive incomes 230350.0 exceeds 100000</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>so we will limit deductions to half of the sum of the negative incomes -48200.0 = -24100.0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>and apply them pro rata to the positive incomes</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>reductio = 0.8953766</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Capital 225000.0 is positive, multiplying by 0.8953766 = 201459.73</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Rents is negative, resetting to 0</dd>
<dt>offsetLosses<sub>2</sub><sub>3</sub><sub>3</sub></dt><dd>Trade 5350.0 is positive, multiplying by 0.8953766 = 4790.265</dd>
</dl>
</div>
</div>

<div id="outline-container-orgb7972e8" class="outline-3">
<h3 id="orgb7972e8"><span class="section-number-3">26.3</span> executing section<sub>34</sub><sub>1</sub>: test case 2</h3>
</div>
